{
    "0": {
        "document_name": "Bioenergy.html",
        "content": "Bioenergy is a type of renewable energy that is derived from plants and animal waste.[1] The biomass that is used as input materials consists of recently living (but now dead) organisms, mainly plants.[2] Thus, fossil fuels are not regarded as biomass under this definition. Types of biomass commonly used for bioenergy include wood, food crops such as corn, energy crops and waste from forests, yards, or farms.[3]\n Bioenergy can help with climate change mitigation but in some cases the required biomass production can increase greenhouse gas emissions or lead to local biodiversity loss. The environmental impacts of biomass production can be problematic, depending on how the biomass is produced and harvested.\n The IEA's Net Zero by 2050 scenario calls for traditional bioenergy to be phased out by 2030, with modern bioenergy's share increasing from 6.6% in 2020 to 13.1% in 2030 and 18.7% in 2050.[4] Bioenergy has a significant climate change mitigation potential if implemented correctly.[5]: 637  Most of the recommended pathways to limit global warming include substantial contributions from bioenergy in 2050 (average at 200 EJ).[6]: B 7.4 \n The IPCC Sixth Assessment Report defines bioenergy as \"energy derived from any form of biomass or its metabolic by-products\".[7]: 1795  It goes on to define biomass in this context as \"organic material excluding the material that is fossilised or embedded in geological formations\".[7]: 1795  This means that coal or other fossil fuels is not a form of biomass in this context.\n The term traditional biomass for bioenergy means \"the combustion of wood, charcoal, agricultural residues and/or animal dung for cooking or heating in open fires or in inefficient stoves as is common in low-income countries\".[7]: 1796 \n Since biomass can also be used as a fuel directly (e.g. wood logs), the terms biomass and biofuel have sometimes been used interchangeably. However, the term biomass usually denotes the biological raw material the fuel is made of. The terms biofuel or biogas are generally reserved for liquid or gaseous fuels respectively.[8]\n Wood and wood residues is the largest biomass energy source today. Wood can be used as a fuel directly or processed into pellet fuel or other forms of fuels. Other plants can also be used as fuel, for instance maize, switchgrass, miscanthus and bamboo.[9] The main waste feedstocks are wood waste, agricultural waste, municipal solid waste, and manufacturing waste. Upgrading raw biomass to higher grade fuels can be achieved by different methods, broadly classified as thermal, chemical, or biochemical:\n Thermal conversion processes use heat as the dominant mechanism to upgrade biomass into a better and more practical fuel. The basic alternatives are torrefaction, pyrolysis, and gasification, these are separated mainly by the extent to which the chemical reactions involved are allowed to proceed (mainly controlled by the availability of oxygen and conversion temperature).[10]\n Many chemical conversions are based on established coal-based processes, such as the Fischer-Tropsch synthesis.[11] Like coal, biomass can be converted into multiple commodity chemicals.[12]\n Biochemical processes have developed in nature to break down the molecules of which biomass is composed, and many of these can be harnessed. In most cases, microorganisms are used to perform the conversion. The processes are called anaerobic digestion, fermentation, and composting.[13]\n Based on the source of biomass, biofuels are classified broadly into two major categories, depending if food crops are used or not:[14]\n First-generation (or \"conventional\") biofuels are made from food sources grown on arable lands, such as sugarcane and maize. Sugars present in this biomass are fermented to produce bioethanol, an alcohol fuel which serves as an additive to gasoline, or in a fuel cell to produce electricity. Bioethanol is made by fermentation, mostly from carbohydrates produced in sugar or starch crops such as corn, sugarcane, or sweet sorghum. Bioethanol is widely used in the United States and in Brazil. Biodiesel is produced from the oils in for instance rapeseed or sugar beets and is the most common biofuel in Europe.[citation needed]\n Second-generation biofuels (also called \"advanced biofuels\") utilize non-food-based biomass sources such as perennial energy crops and agricultural residues/waste. The feedstock used to make the fuels either grow on arable land but are byproducts of the main crop, or they are grown on marginal land. Waste from industry, agriculture, forestry and households can also be used for second-generation biofuels, using e.g. anaerobic digestion to produce biogas, gasification to produce syngas or by direct combustion. Cellulosic biomass, derived from non-food sources, such as trees and grasses, is being developed as a feedstock for ethanol production, and biodiesel can be produced from left-over food products like vegetable oils and animal fats.[citation needed]\n The surface power production densities of a crop will determine how much land is required for production. The average lifecycle surface power densities for biomass, wind, hydro and solar power production are 0.30 W/m2, 1 W/m2, 3 W/m2 and 5 W/m2, respectively (power in the form of heat for biomass, and electricity for wind, hydro and solar).[15] Lifecycle surface power density includes land used by all supporting infrastructure, manufacturing, mining/harvesting and decommissioning. \n Another estimate puts the values at 0.08 W/m2 for biomass, 0.14 W/m2 for hydro, 1.84 W/m2 for wind, and 6.63 W/m2 for solar (median values, with none of the renewable sources exceeding 10 W/m2).[16]\n Carbon capture and storage technology can be used to capture emissions from bioenergy power plants. This process is known as bioenergy with carbon capture and storage (BECCS) and can result in net carbon dioxide removal from the atmosphere. However, BECCS can also result in net positive emissions depending on how the biomass material is grown, harvested, and transported. Deployment of BECCS at scales described in some climate change mitigation pathways would require converting large amounts of cropland.[17] Bioenergy with carbon capture and storage (BECCS) is the process of extracting bioenergy from biomass and capturing and storing the carbon, thereby removing it from the atmosphere.[18] BECCS can theoretically be a \"negative emissions technology\" (NET),[19] although its deployment at the scale considered by many governments and industries can \"also pose major economic, technological, and social feasibility challenges; threaten food security and human rights; and risk overstepping multiple planetary boundaries, with potentially irreversible consequences\".[20] The carbon in the biomass comes from the greenhouse gas carbon dioxide (CO2) which is extracted from the atmosphere by the biomass when it grows. Energy (\"bioenergy\") is extracted in useful forms (electricity, heat, biofuels, etc.) as the biomass is utilized through combustion, fermentation, pyrolysis or other conversion methods. \n Some of the carbon in the biomass is converted to CO2 or biochar which can then be stored by geologic sequestration or land application, respectively, enabling carbon dioxide removal (CDR).[19]\n The climate impact of bioenergy varies considerably depending on where biomass feedstocks come from and how they are grown.[26] For example, burning wood for energy releases carbon dioxide; those emissions can be significantly offset if the trees that were harvested are replaced by new trees in a well-managed forest, as the new trees will absorb carbon dioxide from the air as they grow.[27] However, the establishment and cultivation of bioenergy crops can displace natural ecosystems, degrade soils, and consume water resources and synthetic fertilisers.[28][29] Approximately one-third of all wood used for traditional heating and cooking in tropical areas is harvested unsustainably.[30] Bioenergy feedstocks typically require significant amounts of energy to harvest, dry, and transport; the energy usage for these processes may emit greenhouse gases. In some cases, the impacts of land-use change, cultivation, and processing can result in higher overall carbon emissions for bioenergy compared to using fossil fuels.[29][31]\n Use of farmland for growing biomass can result in less land being available for growing food. In the United States, around 10% of motor gasoline has been replaced by corn-based ethanol, which requires a significant proportion of the harvest.[32][33] In Malaysia and Indonesia, clearing forests to produce palm oil for biodiesel has led to serious social and environmental effects, as these forests are critical carbon sinks and habitats for diverse species.[34][35] Since photosynthesis captures only a small fraction of the energy in sunlight, producing a given amount of bioenergy requires a large amount of land compared to other renewable energy sources.[36]\n Bioenergy can either mitigate (i.e. reduce) or increase greenhouse gas emissions. There is also agreement that local environmental impacts can be problematic.[citation needed] For example, increased biomass demand can create significant social and environmental pressure in the locations where the biomass is produced.[37] The impact is primarily related to the low surface power density of biomass. The low surface power density has the effect that much larger land areas are needed in order to produce the same amount of energy, compared to for instance fossil fuels.\n Long-distance transport of biomass have been criticised as wasteful and unsustainable,[38] and there have been protests against forest biomass export in Sweden[39] and Canada.[40]\n In 2020 bioenergy produced 58 EJ (exajoules) of energy, compared to 172 EJ from crude oil, 157 EJ from coal, 138 EJ from natural gas, 29 EJ from nuclear, 16 EJ from hydro and 15 EJ from wind, solar and geothermal combined.[41] Most of the global bioenergy is produced from forest resources.[42]: 3 [43]: 1 \n Generally, bioenergy expansion fell by 50% in 2020. China and Europe are the only two regions that reported significant expansion in 2020, adding 2 GW and 1.2 GW of bioenergy capacity, respectively.[44]\n Almost all available sawmill residue is already being utilized for pellet production, so there is no room for expansion. For the bioenergy sector to significantly expand in the future, more of the harvested pulpwood must go to pellet mills. However, the harvest of pulpwood (tree thinnings) removes the possibility for these trees to grow old and therefore maximize their carbon holding capacity.[45]: 19  Compared to pulpwood, sawmill residues have lower net emissions: \"Some types of biomass feedstock can be carbon-neutral, at least over a period of a few years, including in particular sawmill residues. These are wastes from other forest operations that imply no additional harvesting, and if otherwise burnt as waste or left to rot would release carbon to the atmosphere in any case.\"[45]: 68"
    },
    "1": {
        "document_name": "Biofuel.html",
        "content": "Biofuel is fuel from recently lifeless or living biological material. It is different to fossil fuels from long dead biological material. Biofuel can be in forms of solid, liquid or gas. \n Biofuels are usually used to power cars, heat homes and for cooking. Biofuel companies are mainly from Europe, Asia and the Americas.  Technologies developed at the Los Alamos National Lab even allows pollution to be converted into renewable biofuel. Agrofuels are biofuels that are produced from specific plants, rather than from waste processes such as landfill or recycled material. \n There are two common ways to convert plants into gas and liquid fuels.  One is to grow crops that are high in sugar (e.g. Sugar cane) or starch (e.g. corn), and then use yeast to ferment ethyl alcohol (ethanol).  The second is to grow plants that contain high amounts of vegetable oil, such as palm oil, soybean and algae.  When these oils are heated, their viscosity is reduced, and they can be burned directly in a diesel engine, or chemically processed to produce fuels such as biodiesel. For thousands of years, Wood and its by-products have been converted into biofuels such as charcoal, wood gas, methanol or ethanol fuel. It is also possible to make cellulosic ethanol from non-edible plant parts, but this can be expensive.\n Solid biomass is also used. Firewood has been used for thousands of years.  Many materials such as wood and grasses can be dried and pelletised and burnt, and this can be used to produce power. [1]"
    },
    "2": {
        "document_name": "Biomass.html",
        "content": "Biomass is a basic term in ecology, and in the energy production industry.\nOrganic waste such as dead plant and animal material, animal dung and kitchen waste can be converted into gaseous fuel called biogas. The organic waste is decomposed by bacteria in biogas digesters to emit biogas which is essentially a mixture of methane and carbon dioxide.\n In ecology, biomass means the accumulation of living matter. It is the total living material in a given area or a biological community or group. Biomass is measured by weight, or by dry weight, per given area (per square metre or square kilometer).\nIn the energy industry, it refers to biological material which can be used as fuel or for industrial production. Biomass includes plant matter grown for use as biofuel, and also includes plant or animal matter used for production of fibres, chemicals or heat. Biomass may also include biodegradable wastes which can be burnt as fuel. It excludes organic material which has been transformed by geological processes into substances such as coal or petroleum. It is usually measured by dry weight.\n The term biomass is especially useful for plants, where some internal structures may not always be considered living tissue, such as the wood (secondary xylem) of a tree.\n Biofuels include bioethanol, biodiesel, biogas, and firewood.\n Biomass is grown from several plants, including switchgrass, hemp, corn, poplar, willow and sugarcane.[2] The particular plant used is usually not very important to the end products, but it does affect the processing of the raw material. \nThough biomass is a renewable fuel, its use can still contribute to global warming. This happens when the natural carbon equilibrium is disturbed; for example by deforestation or urbanization of green sites.\n Biomass is part of the carbon cycle.   Photosynthesis converts carbon from the atmosphere into plant matter.  When the plant rots or burns, the carbon goes back into the atmosphere.  This happens somewhat quickly, and plant matter used as a fuel can be constantly replaced by planting for new growth.  Therefore, it doesn't much change the amount of atmospheric carbon.\n Although fossil fuels come from things that died long ago, they are not considered biomass by the generally accepted definition because they contain carbon that has been 'out' of the carbon cycle for a very long time.  Burning fossil fuels in combustion therefore adds much carbon dioxide to the atmosphere.\n Other uses of biomass, besides fuel:\n Plastics from biomass, like some made to dissolve in seawater, are made the same way as petroleum-based plastics, are actually cheaper to manufacture and meet or exceed most performance standards. But they lack the water resistance of conventional plastics.[3]\n The most successful animal, in terms of biomass, is the Antarctic krill, Euphausia superba, with a biomass of probably over 500 million tons across the world, about twice the total biomass of humans. \nBiomass may also be a measure of the dried organic mass of an ecosystem.\n This is a summary of biomass data.[4]"
    },
    "3": {
        "document_name": "Electricity.html",
        "content": "Electricity is the presence and flow of electric current. Using electricity, we can transfer energy in ways that allow us to do simple chores.[1] Its best-known form is the flow of electrons through conductors such as copper wires.\n The word \"electricity\" is sometimes used to mean \"electrical energy\". They are not the same thing: electricity is a transmission medium for electrical energy, like sea water is a transmission medium for wave energy. An item which allows electricity to move through it is called a conductor. Copper wires and other metal items are good conductors, allowing electricity to move through them and transmit electrical energy. Plastics are a poor conductor (they are insulators) and don't allow much electricity to move through them. They stop the transmission of electrical energy.\n Electrical energy can be made naturally (such as lightning), or by people (such as in a generator). It can be used to power machines and electrical devices. When electrical charges are not moving, electricity is called static electricity. When the charges are moving they are an electric current, sometimes called 'dynamic electricity'. Lightning is the most known - and dangerous - kind of electric current in nature, but sometimes static electricity causes things to stick together in nature as well.\n Electricity can be dangerous, especially around water because water is a form of good conductor as it has impurities like salt in it. Salt can help electricity flow. Since the nineteenth century, electricity has been used in every part of our lives. Until then, it was just a curiosity seen in the lightning of a thunderstorm.\n Electrical energy can be created if a magnet passes close to a metal wire. This is the method used by a generator. The biggest generators are in power stations. Electrical energy can also be released by combining chemicals in a jar with two different kinds of metal rods. This is the method used in a battery. Static electricity can be created through the friction between two materials - for instance a wool cap and a plastic ruler. This may make a spark. Electrical energy can also be created using energy from the sun, as in photovoltaic cells.\n Electrical energy arrives at homes through wires from the places where it is made. It is used by electric lamps, electric heaters, etc. Many appliances such as washing machines and electric cookers use electricity. In factories, electrical energy powers machines. People who work with electricity and electrical devices in homes and factories are called \"electricians\".\n The idea of electricity, or the fact that amber acquires the power to attract light objects when rubbed, may have been known to the Greek philosopher Thales of Miletus, who lived about 600 B.C.\n Another Greek philosopher, Theophrastus, stated in a treatise that this power is possessed by other substances.\n The first scientific study of electrical and magnetic happenings, however, did not appear until A.D. 1600, from research done by the English physician William Gilbert. Gilbert was the first to apply the term electric (Greek, elektron, \"amber\") to the force that substances exerted after being rubbed. He also distinguished between magnetic and electric action.\n Ben Franklin spent much time in electrical research. His famous kite experiment proved that the atmospheric electricity (that causes the phenomena of lightning and thunder) is identical with the electrostatic charge on a Leyden jar. Franklin developed his theory that electricity is a single \"fluid\" existing in all matter, and that its effects can be explained by excesses and shortages of this fluid.\n There are two types of electric charges that push and pull on each other: positive charges and negative charges. Electric charges push or pull on each other if they are not touching. This is possible because each charge makes an electric field around itself. An electric field is an area that surrounds a charge. At each point near a charge, the electric field points in a certain direction. If a positive charge is put at that point, it will be pushed in that direction. If a negative charge is put at that point, it will be pushed in the exact opposite direction.\n It works like magnets, and in fact, electricity creates a magnetic field, in which similar charges repel each other and opposite charges attract. This means that if you put two negatives close together and let them go, they would move apart. The same is true for two positive charges. But if you put a positive charge and a negative charge close together, they would pull towards each other. A short way to remember this is the phrase opposites attract, likes repel.\n All the matter in the universe is made of tiny particles with positive, negative or neutral charges. The positive charges are called protons, and the negative charges are called electrons. Protons are much heavier than electrons, but they both have the same amount of electric charge, except that protons are positive and electrons are negative. Because \"opposites attract,\" protons and electrons stick together. A few protons and electrons can form bigger particles called atoms and molecules. Atoms and molecules are still very tiny. They are too small to see. Any large object, like your finger, has more atoms and molecules in it than anyone can count. We can only estimate how many there are. \n Because negative electrons and positive protons stick together to make big objects, all big objects that we can see and feel are electrically neutral. Electrically is a word meaning \"describing electricity\", and neutral is a word meaning \"balanced.\" That is why we do not feel objects pushing and pulling on us from a distance, as they would if everything was electrically charged. All big objects are electrically neutral because there is the same amount of positive and negative charge in the world. We could say that the world is exactly balanced, or neutral. Scientists still do not know why this is so.\n The electrons can move all around the material. Protons never move around a solid object because they are so heavy, at least compared to the electrons. A material that lets electrons move around is called a conductor. A material that keeps each electron tightly in place is called an insulator. Examples of conductors are copper, aluminum, silver, and gold. Examples of insulators are rubber, plastic, and wood. Copper is used very often as a conductor because it is a very good conductor and there is so much of it in the world. Copper is found in electrical wires. But sometimes, other materials are used.\n Inside a conductor, electrons bounce around, but they do not keep going in one direction for long. If an electric field is set up inside the conductor, the electrons will all start to move in the direction opposite to the direction the field is pointing (because electrons are negatively charged). A battery can make an electric field inside a conductor. If both ends of a piece of wire are connected to the two ends of a battery (called the electrodes), the loop that was made is called an electrical circuit. Electrons will flow around and around the circuit as long as the battery is making an electric field inside the wire. This flow of electrons around the circuit is called electric current.\n A conducting wire used to carry electric current is often wrapped in an insulator such as rubber. This is because wires that carry current are very dangerous. If a person or an animal touched a bare wire carrying current, they could get hurt or even die depending on how strong the current was and how much electrical energy the current is transmitting. You should be careful around electrical sockets and bare wires that might be carrying current.\n It is possible to connect an electrical device to a circuit so that electrical current will flow through a device. This current will transmit electrical energy to make the device do something that we want it to do. Electrical devices can be very simple. For example, in a light bulb, current carries energy through a special wire called a filament, which makes it glow. Electrical devices can also be very complicated. Electrical energy can be used to drive an electric motor inside a tool like a drill or a pencil sharpener. Electrical energy is also used to power modern electronic devices, including telephones, computers, and televisions.\n Here are a few terms that a person can come across when studying how electricity works. The study of electricity and how it makes electrical circuits possible is called electronics. There is a field of engineering called electrical engineering, where people come up with new things using electricity. All of these terms are important for them to know.\n Electrical energy is mostly generated in places called power stations. Most power stations use heat to boil water into steam which turns a steam engine. The steam engine's turbine turns a machine called a 'generator'. Coiled wires inside the generator are made to spin in a magnetic field. This causes electricity to flow through the wires, carrying electrical energy. This process is called electromagnetic induction. Michael Faraday discovered how to do this.\n Many sources of heat can be used to boil water for generators. Heat sources may use renewable energy resources in which the supply of heat energy never runs out and non-renewable energy resources in which the supply will be eventually used up.\n Sometimes a natural flow, such as wind power or water power, can be used directly to turn a generator so no heat is needed."
    },
    "4": {
        "document_name": "Geothermal_energy.html",
        "content": "Geothermal energy (from the Greek roots geo, meaning earth, and from thermos, meaning heat) is a renewable energy made by heat inside the Earth's crust.[1]\n Although the Sun does heat the surface of the Earth, the heat from inside the Earth is not caused by the Sun. The geothermal energy of the Earth's crust comes 20% from the original formation of the planet, and 80% from the radioactive decay of minerals.[2][3]  The Earth is hottest at its core and, from the core to the surface, the temperature gets gradually cooler.\n Resources of geothermal energy range from the shallow ground to hot water and hot rock found a few miles or kilometers beneath the Earth's surface, and down even deeper to the extremely high temperatures of molten rock called magma. It has been used for bathing from Paleolithic times, but is now better known for making electricity.[1]\n All over the world, geothermal energy was used to make about 10 gigawatts of electricity in the year 2007, about 0.3% of the electricity used around the world.  When used to generate electricity, geothermal power plants typically offer constant output.[4]\n Geothermal energy is also used directly for district heating, or in other heating and cooling applications. Buildings in Iceland are heated in this way from the country's many geothermal sites.\n Power plants and thermal applications of geothermal energy are mature technologies, whereas enhanced geothermal systems (EGS) projects are a new type of application.[4]\n Almost everywhere, the ground 10 feet (3m) below the Earth's surface maintains a nearly constant temperature between 50° and 60 °F (10° and 16 °C). Geothermal heat pumps can tap into this resource to heat and cool buildings. A geothermal heat pump system consists of a heat pump, an air delivery system (ductwork),[5] and a heat exchanger - a system of pipes buried in the shallow ground near the building. In the winter, the heat pump uses power to remove heat from the heat exchanger and pumps it into the indoor air delivery system. In the summer, the process is reversed, and the heat pump uses power again to move heat from the indoor air into the heat exchanger. The heat removed from the indoor air during the summer can also be used to provide a free source of hot water. The power to run the heat pump comes from another source.\n Geothermal energy escapes as hot water at many hot springs or as steam at geysers.\n In the United States, most geothermal reservoirs of hot water are in the western states, Alaska, and Hawaii. Wells can be drilled into underground reservoirs for the generation of electricity. Some geothermal power plants use the steam from a reservoir to power a turbine / generator, while others use the hot water to boil a working fluid that vaporizes and then turns a turbine. Hot water near the surface of Earth can be used directly for heat. Direct-use applications include heating buildings, growing plants in greenhouses, drying crops, heating water at fish farms, and several industrial processes such as pasteurizing milk.\n Hot dry rock resources occur at depths of 3 to 5 miles (5–8 km) everywhere beneath the Earth's surface and at lesser depths in certain areas. Access to these resources involves injecting cold water down one well, circulating it through hot fractured rocks, and drawing off the heated water from another well. Currently, nobody uses this method commercially. Existing technology also does not yet allow recovery of heat directly from magma, the very deep and most powerful resource of geothermal energy."
    },
    "5": {
        "document_name": "Hydropower.html",
        "content": "Hydropower is the capture of the energy of moving water for some useful purpose. \n In the 1830s, at the peak of the canal-building era, hydropower was used to transport barge traffic up and down steep hills using inclined plane railroads. For direct mechanical power transmission industries that used hydropower had to be near the waterfall. For example, during the last half of the 19th century, many grist mills were built at Saint Anthony Falls, to use the 50 foot (15 metre) drop in the Mississippi River. The mills were important for the growth of Minneapolis. Today the largest use of hydropower is for electric power generation. That allows low cost energy to be used at long distances from the watercourse. \n There are many forms of water power:\n Main article: Hydroelectricity\n Hydroelectric power is a means of making electricity without burning fuel. Hydroelectric power supplies about 715,000 MWe or 19% of world electricity (16% in 2003). Large dams are still being designed. Apart from a few countries with plenty of it, hydro power is normally applied to peak load demand because it is readily stopped and started. Nevertheless, hydroelectric power is probably not a major option for future energy production in the developed nations, because most major sites within these nations are either already being exploited or are unavailable for other reasons, such as environmental considerations.\n Hydropower produces essentially no carbon dioxide or other harmful emissions, in contrast to burning fossil fuels, and is not a significant contributor to global warming through CO2.\n Hydroelectric power can be far less expensive than electricity generated from fossil fuel or nuclear energy. Areas with abundant hydroelectric power attract industry. Environmental concerns about the effects of reservoirs may prohibit development of economic hydropower sources.\n Harnessing the tides in a bay or estuary has been achieved in France (since 1966), Canada and Russia, and could be achieved in other areas with a large tidal range. The trapped water turns turbines as it is released through the tidal barrage in either direction. Another possible fault is that the system would generate electricity most efficiently in bursts every six hours (once every tide). This limits how tidal energy can be used. \n A relatively new technology, tidal stream generators draw energy from currents in much the same way that wind generators do. The higher density of water means that a single generator can provide significant power. This technology is at the early stages of development and will need more research before it can produce any higher amount of energy.\n But several prototypes were tested in the UK, in France and the USA. Already in 2003 a turbine that produces 300 kW was tested in the UK.\n The Canadian company Blue Energy has plans for installing very large arrays tidal current devices mounted in what they call a 'tidal fence' in various locations around the world, based on a vertical axis turbine design.\n Power from ocean surface wave motion might produce much more energy than tides. It has been tested that it is possible to produce energy from waves, particularly in Scotland in the UK. But there are still a lot of technical problems.\n A prototype shore based wave power generator is being constructed at Port Kembla in Australia and is expected to generate up to 500 MWh annually. Wave energy is captured by an air driven generator and converted to electricity. For countries with large coastlines and rough sea conditions, the energy of waves offers the possibility of generating electricity in utility volumes. Excess power during rough seas could be used to produce hydrogen."
    },
    "6": {
        "document_name": "List_of_books_about_renewable_energy.html",
        "content": "This is a bibliography of renewable energy.\n Renewable energy is energy which comes from natural resources such as sunlight, wind, rain, tides, and geothermal heat, which are renewable (naturally replenished). About 16% of global final energy consumption comes from renewables, with 10% coming from traditional biomass, which is mainly used for heating, and 3.4% from hydroelectricity. New renewables (small hydro, modern biomass, wind, solar, geothermal, and biofuels) account for another 3% and are growing very rapidly.[1]\n Total investment in renewable energy reached $244 billion in 2012. The top countries for investment in recent years were China, Germany, Spain, the United States, Italy, and Brazil.[2][3] Leading renewable energy companies include BrightSource Energy, Enercon, First Solar, Gamesa, GE Energy, Goldwind, Nordex, Sinovel, Suntech, Trina Solar, Vestas and Yingli.[4][5]\n Academic journals\n Other"
    },
    "7": {
        "document_name": "List_of_renewable_energy_topics_by_country_and_territory.html",
        "content": "This is a list of renewable energy topics by country and territory.  These links can be used to compare developments in renewable energy in different countries and territories and to help and encourage new writers to participate in writing about developments in their own countries or countries of interest.\n The list refers to renewable energy in general, as well as solar power, wind power, geothermal energy, biofuel, and hydropower. As of 2013, China, Germany, and Japan, and India, four of the world's largest economies generate more electricity from renewables than from nuclear power.\n Based on REN21's 2014 report, renewables supplied 19% of humans' global energy consumption. This energy consumption is divided as 9% coming from traditional biomass, 4.2% as heat energy (non-biomass), 3.8% hydro electricity and 2% is electricity from wind, solar, geothermal, and biomass.\n China is the world's largest producer of hydroelectricity, followed by Canada, Brazil, India, U.S and Russia. Wind power capacity is growing at the rate of 26% annually, and is widely used in Europe, Asia, and the United States.[1] Wind power accounts for approximately 30% of electricity use in Denmark, 20% in Portugal, and 18% in Spain.[2]\n Long considered climate policy’s problem case due to its large population and fast growing economy, India is exceeding targets and breaking records and has become the fastest in adoption of clean and renewable energy.[3]\n PV power stations are popular in Japan, China and the United States. The world's largest geothermal power installation is The Geysers in California, with a rated capacity of 750 MW.[4] Brazil has one of the largest renewable energy programs in the world, involving production of ethanol fuel from sugar cane, and ethanol now provides 18 percent of the country's automotive fuel.[5] Ethanol fuel is also widely available in the United States. Plug-in electric vehicles in Norway reached a market share of 22.4% in 2015,[6] the highest in the world.\n While many renewable energy projects are large-scale, renewable technologies are also suited to developing countries, where energy is often crucial in human development. Small solar PV systems provide electricity to a few million households, and micro-hydro configured into mini-grids serves many more."
    },
    "8": {
        "document_name": "Main_Page.html",
        "content": "When writing articles here:\n Dan Kelly (1861 – 28 June 1880) was an Australian bushranger and outlaw. The son of an Irish convict, he was the youngest brother of the bushranger, Ned Kelly. Dan and his brother killed three policemen. With two friends, they formed the Kelly Gang. Dan Kelly died during the famous siege of Glenrowan.\n More books have been written about the Kelly Gang than any other subject in Australian history. The Kelly Gang were the subject of the world's first full length feature movie, The Story of the Kelly Gang, made in 1906. They robbed banks, took over whole towns, kept the people in Victoria and New South Wales frightened. For two years the Victorian police searched for them, locked up their friends and families, but could not find them.\n \n From a collection of Wikipedia's articles:\n \n See the pages of the Wikimedia Foundation Governance wiki, too.\n English  •  Cebuano (Cebuano)\n العربية (Arabic)  •  \nمصرى (Egyptian Arabic)  •  \nDeutsch (German)  • \nespañol (Spanish)  • \nfrançais (French)  • \nitaliano (Italian)  • \n日本語 (Japanese)  • \nNederlands (Dutch)  • \npolski (Polish)  • \nportuguês (Portuguese)  • \nрусский (Russian)  • \nsvenska (Swedish)  • \nукраїнська (Ukrainian)  • \nTiếng Việt (Vietnamese)  • \nWinaray (Waray)  • \n中文 (Chinese)\n català (Catalan)  • \nнохчийн (Chechen)  • \nčeština (Czech)  • \nفارسی (Persian)  • \nsuomi (Finnish)  • \nmagyar (Hungarian)  • \nBahasa Indonesia (Indonesian)  • \n한국어 (Korean)  • \nnorsk (Norwegian)  • \nсрпски / srpski (Serbian)  • \nTürkçe (Turkish)\n Simple English  • \nAfrikaans (Afrikaans)  • \nasturianu (Asturian)  • \nazərbaycanca (Azerbaijani)  • \nتۆرکجه (South Azerbaijani)  • \nбеларуская (Belarusian)  • \nбългарски (Bulgarian)  • \nবাংলা (Bangla)  • \nCymraeg (Welsh)  • \ndansk (Danish)  • \nΕλληνικά (Greek)  • \nEsperanto (Esperanto)  • \neesti (Estonian)  • \neuskara (Basque)  • \ngalego (Galician)  • \nעברית (Hebrew)  • \nहिन्दी (Hindi)  • \nhrvatski (Croatian)  • \nհայերեն (Armenian)  • \nქართული (Georgian)  • \nқазақша (Kazakh)  • \nLatina (Latin)  • \nLadin (Ladin)  • \nlietuvių (Lithuanian)  • \nlatviešu (Latvian)  • \nMinangkabau (Minangkabau)  • \nмакедонски (Macedonian)  • \nBahasa Melayu (Malay)  • \nမြန်မာဘာသာ (Burmese)  • \nnorsk nynorsk (Norwegian Nynorsk)  • \nromână (Romanian)  • \nsrpskohrvatski / српскохрватски (Serbo-Croatian)  • \nslovenčina (Slovak)  • \nslovenščina (Slovenian)  • \nதமிழ் (Tamil)  • \nтоҷикӣ (Tajik)  • \nไทย (Thai)  • \nтатарча / tatarça (Tatar)  • \nاردو (Urdu)  • \noʻzbekcha / ўзбекча (Uzbek)  • \nVolapük (Volapük)  • \n粵語 (Cantonese)  • \nBân-lâm-gú (Minnan)\n List of all Wikipedias – \nLanguages working together – \nStart a Wikipedia for a new language"
    },
    "9": {
        "document_name": "Renewable_energy.html",
        "content": "Renewable energy, green energy, or low-carbon energy is energy from renewable resources that are naturally replenished on a human timescale. Renewable resources include sunlight, wind, the movement of water, and geothermal heat.[1][2][3][4][5][6][7][excessive citations] Although most renewable energy sources are sustainable, some are not. For example, some biomass sources are considered unsustainable at current rates of exploitation.[8][9] Renewable energy is often used for electricity generation, heating and cooling. Renewable energy projects are typically large-scale, but they are also suited to rural and remote areas and developing countries, where energy is often crucial in human development.[10][11]\n Renewable energy is often deployed together with further electrification, which has several benefits: electricity can move heat or objects efficiently, and is clean at the point of consumption.[12][13] From 2011 to 2021, renewable energy grew from 20% to 28% of global electricity supply. Use of fossil energy shrank from 68% to 62%, and nuclear from 12% to 10%. The share of hydropower decreased from 16% to 15% while power from sun and wind increased from 2% to 10%. Biomass and geothermal energy grew from 2% to 3%. There are 3,146 gigawatts installed in 135 countries, while 156 countries have laws regulating the renewable energy sector.[14][15] In 2021, China accounted for almost half of the global increase in renewable electricity.[16]\n Globally there are over 10 million jobs associated with the renewable energy industries, with solar photovoltaics being the largest renewable employer.[17] Renewable energy systems are rapidly becoming more efficient and cheaper and their share of total energy consumption is increasing,[18] with a large majority of worldwide newly installed electricity capacity being renewable.[19] In most countries, photovoltaic solar or onshore wind are the cheapest new-build electricity.[20]\n Many nations around the world already have renewable energy contributing more than 20% of their total energy supply, with some generating over half their electricity from renewables.[21] A few countries generate all their electricity using renewable energy.[22] National renewable energy markets are projected to continue to grow strongly in the 2020s and beyond.[23] According to the IEA, to achieve net zero emissions by 2050, 90% of global electricity generation will need to be produced from renewable sources.[24] Some studies say that a global transition to 100% renewable energy across all sectors – power, heat, transport and industry – is feasible and economically viable.[25][26][27]\n Renewable energy resources exist over wide geographical areas, in contrast to fossil fuels, which are concentrated in a limited number of countries. Deployment of renewable energy and energy efficiency technologies is resulting in significant energy security, climate change mitigation, and economic benefits.[28] However renewables are being hindered by hundreds of billions of dollars of fossil fuel subsidies.[29] In international public opinion surveys there is strong support for renewables such as solar power and wind power.[30][31] In 2022 the International Energy Agency asked countries to solve policy, regulatory, permitting and financing obstacles to adding more renewables, to have a better chance of reaching net zero carbon emissions by 2050.[32]\n Renewable energy is usually understood as energy harnessed from continuously occurring natural phenomena. The International Energy Agency defines it as \"energy derived from natural processes that are replenished at a faster rate than they are consumed.” Solar power, wind power, hydroelectricity, geothermal energy, and biomass are widely agreed to be the main types of renewable energy.[35] Renewable energy often displaces conventional fuels in four areas: electricity generation, hot water/space heating, transportation, and rural (off-grid) energy services.[36]\n Although almost all forms of renewable energy cause much fewer carbon emissions than fossil fuels, the term is not synonymous with low-carbon energy. Some non-renewable sources of energy, such as nuclear power, generate almost no emissions, while some renewable energy sources can be very carbon-intensive, such as the burning of biomass if it is not offset by planting new plants.[37] Renewable energy is also distinct from sustainable energy, a more abstract concept that seeks to group energy sources based on their overall permanent impact on future generations of humans. For example, biomass is often associated with unsustainable deforestation.[38]\n As part of the global effort to address climate change, most of the world's countries have committed substantially reducing their greenhouse gas emissions. In practice, this means phasing out fossil fuels and replacing them with low-emissions energy sources.[37] At the 2023 United Nations Climate Change Conference, around three-quarters of the world's countries set a goal of tripling renewable energy capacity by 2030.[40] The European Union aims to generate 40% of its electricity from renewables by the same year.[41]\n Renewable energy is also more evenly distributed around the world than fossil fuels, which are concentrated in a limited number of countries.[42] It also brings health benefits by reducing air pollution caused by the burning of fossil fuels. The potential worldwide savings in health care costs have been estimated at trillions of dollars annually.[43]\n New government spending, regulation and policies helped the renewables industry weather the global financial crisis better than many other sectors.[44] In 2022, renewables accounted for 30% of global electricity generation, up from 21% in 1985.[45]\n Solar power produced around 1.3 terrawatt-hours (TWh) worldwide in 2022,[21] representing 4.6% of the world's electricity. Almost all of this growth has happened since 2010.[51] Solar energy can be harnessed anywhere that receives sunlight; however, the amount of solar energy that can be harnessed for electricity generation is influenced by weather conditions, geographic location and time of day.[52]\n There are two mainstream ways of harnessing solar energy: solar thermal, which converts solar energy into heat; and photovoltaics (PV), which converts it into electricity.[37] PV is far more widespread, accounting for around two thirds of the global solar energy capacity as of 2022.[53] It is also growing at a much faster rate, with 170 GW newly installed capacity in 2021,[54] compared to 25 GW of solar thermal.[53]\n Passive solar refers to a range of construction strategies and technologies that aim to optimize the distribution of solar heat in a building. Examples include solar chimneys,[37] orienting a building to the sun, using construction materials that can store heat, and designing spaces that naturally circulate air.[55]\n A photovoltaic system, consisting of solar cells assembled into panels, converts light into electrical direct current via the photoelectric effect.[58] Almost all commercial PV cells consist of crystalline silicon, with a market share of 95%. Cadmium telluride thin-film solar cells account for the remainder.[59] PV has several advantages that make it by far the fastest-growing renewable energy technology. It is cheap, low-maintenance and scalable; adding to an existing PV installation as demanded arises is simple. Its main disadvantage is its poor performance in cloudy weather.[37]\n PV systems range from small, residential and commercial rooftop or building integrated installations, to large utility-scale photovoltaic power station. Building-integrated PV uses existing land and structures to generate power close to where it is consumed.[60] A household's solar panels, and batteries if they have them, can often either be used for just that household or if connected to an electrical grid can be aggregated with millions of others.[61] As of 2022, around 25 million households rely on rooftop solar power worldwide.[62] Australia has by far the most rooftop solar capacity per capita.[63]\n The first utility-scale solar power plant was built in 1982 in Hesperia, California by ARCO.[64] The plant was not profitable and was sold eight years later.[65] However, over the following decades, PV technology significantly improved its electricity generating efficiency, reduced the installation cost per watt as well as its energy payback time, and reached grid parity.[66] As a result, PV adoption has grown exponentially since 2010.[67] Global capacity increased from 230 GW at the end of 2015 to 890 GW in 2021.[68] PV grew fastest in China between 2016 and 2021, adding 560 GW, more than all advanced economies combined.[69] Four of the ten biggest solar power stations are in China, including the biggest, Golmud Solar Park in China.[70] Many utility-scale PV systems use tracking systems that follow the sun's daily path across the sky to generate more electricity than fixed-mounted systems.[71]\n Solar thermal energy (STE) is a form of energy and a technology for harnessing solar energy to generate thermal energy for use in industry, and in the residential and commercial sectors.\n Solar thermal collectors are classified by the United States Energy Information Administration as low-, medium-, or high-temperature collectors. Low-temperature collectors are generally unglazed and used to heat swimming pools or to heat ventilation air. Medium-temperature collectors are also usually flat plates but are used for heating water or air for residential and commercial use.\n Humans have harnessed wind energy since at least 3500 BC. Until the 20th century, it was primarily used to power ships, windmills and water pumps. Today, the vast majority of wind power is used to generate electricity using wind turbines.[37] Modern utility-scale wind turbines range from around 600 kW to 9 MW of rated power. The power available from the wind is a function of the cube of the wind speed, so as wind speed increases, power output increases up to the maximum output for the particular turbine.[76] Areas where winds are stronger and more constant, such as offshore and high-altitude sites, are preferred locations for wind farms.\n Wind-generated electricity met nearly 4% of global electricity demand in 2015, with nearly 63 GW of new wind power capacity installed. Wind energy was the leading source of new capacity in Europe, the US and Canada, and the second largest in China. In Denmark, wind energy met more than 40% of its electricity demand while Ireland, Portugal and Spain each met nearly 20%.[77]\n Globally, the long-term technical potential of wind energy is believed to be five times total current global energy production, or 40 times current electricity demand, assuming all practical barriers needed were overcome. This would require wind turbines to be installed over large areas, particularly in areas of higher wind resources, such as offshore, and likely also industrial use of new types of VAWT turbines in addition to the horizontal axis units currently in use. As offshore wind speeds average ~90% greater than that of land, offshore resources can contribute substantially more energy than land-stationed turbines.[78]\n Since water is about 800 times denser than air, even a slow flowing stream of water, or moderate sea swell, can yield considerable amounts of energy. Water can generate electricity with a conversion efficiency of about 90%, which is the highest rate in renewable energy.[82] There are many forms of water energy:\n Hydropower is produced in 150 countries, with the Asia-Pacific region generating 32 percent of global hydropower in 2010.[needs update] Of the top 50 countries by percentage of electricity generated from renewables, 46 are primarily hydroelectric.[86] There are now seven hydroelectricity stations larger than 10 GW (10,000 MW) worldwide, see table below.\n Much hydropower is flexible, thus complementing wind and solar.[87] In 2021, the world renewable hydropower capacity was 1,360 GW.[69] Only a third of the world's estimated hydroelectric potential of 14,000 TWh/year has been developed.[88][89] New hydropower projects face opposition from local communities due to their large impact, including relocation of communities and flooding of wildlife habitats and farming land.[90] High cost and lead times from permission process, including environmental and risk assessments, with lack of environmental and social acceptance are therefore the primary challenges for new developments.[91] It is popular to repower old dams thereby increasing their efficiency and capacity as well as quicker responsiveness on the grid.[92] Where circumstances permit existing dams such as the Russell Dam built in 1985 may be updated with \"pump back\" facilities for pumped-storage which is useful for peak loads or to support intermittent wind and solar power. Because dispatchable power is more valuable than VRE[93][94] countries with large hydroelectric developments such as Canada and Norway are spending billions to expand their grids to trade with neighboring countries having limited hydro.[95]\n Biomass is biological material derived from living, or recently living organisms. It commonly refers to plants or plant-derived materials. As an energy source, biomass can either be used directly via combustion to produce heat, or indirectly after converting it to various forms of biofuel in solid, liquid or gaseous form. Conversion of biomass to biofuel can be achieved by different methods which are broadly classified into: thermal, chemical, and biochemical methods. Wood was the largest biomass energy source as of 2012;[99] examples include forest residues – such as dead trees, branches and tree stumps, yard clippings, wood chips and even municipal solid waste. Industrial biomass can be grown from numerous types of plants, including miscanthus, switchgrass, hemp, corn, poplar, willow, sorghum, sugarcane, bamboo,[100] and a variety of tree species, ranging from eucalyptus to oil palm (palm oil).\n Plant energy is produced by crops specifically grown for use as fuel that offer high biomass output per hectare with low input energy.[101] The grain can be used for liquid transportation fuels while the straw can be burned to produce heat or electricity. Plant biomass can also be degraded from cellulose to glucose through a series of chemical treatments, and the resulting sugar can then be used as a first-generation biofuel.\n Biomass can be converted to other usable forms of energy such as methane gas[102] or transportation fuels such as ethanol and biodiesel. Rotting garbage, and agricultural and human waste, all release methane gas – also called landfill gas or biogas. Crops, such as corn and sugarcane, can be fermented to produce the transportation fuel, ethanol. Biodiesel, another transportation fuel, can be produced from left-over food products such as vegetable oils and animal fats.[103] There is a great deal of research involving algal fuel or algae-derived biomass due to the fact that it is a non-food resource, grows around 20 times faster than other types of food crops, such as corn and soy, and can be grown almost anywhere.[104][105] Once harvested, it can be fermented to produce biofuels such as ethanol, butanol, and methane, as well as biodiesel and hydrogen. The biomass used for electricity generation varies by region. Forest by-products, such as wood residues, are common in the United States. Agricultural waste is common in Mauritius (sugar cane residue) and Southeast Asia (rice husks).\n Biomass, biogas and biofuels are burned to produce heat/power and in doing so can harm the environment. Pollutants such as sulphurous oxides (SOx), nitrous oxides (NOx), and particulate matter (PM) are produced from the combustion of biomass. With regards to traditional use of biomass for heating and cooking, the World Health Organization estimates that 3.7 million prematurely died from outdoor air pollution in 2012 while indoor pollution from biomass burning effects over 3 billion people worldwide.[106][107]\n Bioenergy global capacity in 2021 was 158 GW. Biofuels avoided 4.4% of global transport fuel demand in 2021.[69]\n Biofuels include a wide range of fuels which are derived from biomass. The term covers solid, liquid, and gaseous fuels.[108] Liquid biofuels include bioalcohols, such as bioethanol, and oils, such as biodiesel. Gaseous biofuels include biogas, landfill gas and synthetic gas. Bioethanol is an alcohol made by fermenting the sugar components of plant materials and it is made mostly from sugar and starch crops. These include maize, sugarcane and, more recently, sweet sorghum. The latter crop is particularly suitable for growing in dryland conditions, and is being investigated by International Crops Research Institute for the Semi-Arid Tropics for its potential to provide fuel, along with food and animal feed, in arid parts of Asia and Africa.[109]\n With advanced technology being developed, cellulosic biomass, such as trees and grasses, are also used as feedstocks for ethanol production. Ethanol can be used as a fuel for vehicles in its pure form, but it is usually used as a gasoline additive to increase octane and improve vehicle emissions. Bioethanol is widely used in the United States and in Brazil. The energy costs for producing bio-ethanol are almost equal to, the energy yields from bio-ethanol. However, according to the European Environment Agency, biofuels do not address global warming concerns.[110] Biodiesel is made from vegetable oils, animal fats or recycled greases. It can be used as a fuel for vehicles in its pure form, or more commonly as a diesel additive to reduce levels of particulates, carbon monoxide, and hydrocarbons from diesel-powered vehicles. Biodiesel is produced from oils or fats using transesterification and is the most common biofuel in Europe. Biofuels provided 2.7% of the world's transport fuel in 2010.[111][needs update]\n Policies in more than 80 countries support biofuels demand.[69]\n Since the 1970s, Brazil has had an ethanol fuel program which has allowed the country to become the world's second largest producer of ethanol (after the United States) and the world's largest exporter.[112] Brazil's ethanol fuel program uses modern equipment and cheap sugarcane as feedstock, and the residual cane-waste (bagasse) is used to produce heat and power.[113] There are no longer light vehicles in Brazil running on pure gasoline.[114]\n Biojet is expected to be important for short-term reduction of carbon dioxide emissions from long-haul flights.[115]\n High temperature geothermal energy is from thermal energy generated and stored in the Earth. Thermal energy is the energy that determines the temperature of matter. Earth's geothermal energy originates from the original formation of the planet and from radioactive decay of minerals (in currently uncertain[120] but possibly roughly equal[121] proportions). The geothermal gradient, which is the difference in temperature between the core of the planet and its surface, drives a continuous conduction of thermal energy in the form of heat from the core to the surface. The adjective geothermal originates from the Greek roots geo, meaning earth, and thermos, meaning heat.\n The heat used for geothermal energy can be from deep within the Earth, all the way down to Earth's core – 6,400 kilometres (4,000 mi) down. At the core, temperatures may reach over 5,000 °C (9,030 °F). Heat conducts from the core to the surrounding rock. Extremely high temperature and pressure cause some rock to melt, which is commonly known as magma. Magma convects upward since it is lighter than the solid rock. This magma then heats rock and water in the crust, sometimes up to 371 °C (700 °F).[122]\n Low temperature geothermal[123] refers to the use of the outer crust of the Earth as a thermal battery to facilitate renewable thermal energy for heating and cooling buildings, and other refrigeration and industrial uses. In this form of geothermal, a geothermal heat pump and ground-coupled heat exchanger are used together to move heat energy into the Earth (for cooling) and out of the Earth (for heating) on a varying seasonal basis. Low-temperature geothermal (generally referred to as \"GHP\"[clarification needed]) is an increasingly important renewable technology because it both reduces total annual energy loads associated with heating and cooling, and it also flattens the electric demand curve eliminating the extreme summer and winter peak electric supply requirements. Thus low temperature geothermal/GHP is becoming an increasing national[clarification needed] priority with multiple tax credit support[124] and focus as part of the ongoing movement toward net zero energy.[125]\n Geothermal power is cost effective, reliable, sustainable, and environmentally friendly,[126] but has historically been limited to areas near tectonic plate boundaries. Recent technological advances have expanded the range and size of viable resources, especially for applications such as home heating, opening a potential for widespread exploitation. Geothermal wells release greenhouse gases trapped deep within the earth, but these emissions are usually much lower per energy unit than those of fossil fuels. \n In 2017, the United States led the world in geothermal electricity production with 12.9 GW of installed capacity.[68] The largest group of geothermal power plants in the world is located at The Geysers, a geothermal field in California.[127] The Philippines follows the US as the second highest producer of geothermal power in the world, with 1.9 GW of capacity online.[68]\n Global geothermal capacity in 2021 was 15 GW.[69]\n There are also other renewable energy technologies that are still under development, including concentrated solar power, cellulosic ethanol, hot-dry-rock geothermal power, and marine energy.[128][129] These technologies are not yet widely demonstrated or have limited commercialization. Many are on the horizon and may have potential comparable to other renewable energy technologies, but still depend on attracting sufficient attention and research, development and demonstration (RD&D) funding.[129]\n There are numerous organizations within the academic, federal,[clarification needed] and commercial sectors conducting large-scale advanced research in the field of renewable energy. This research spans several areas of focus across the renewable energy spectrum. Most of the research is targeted at improving efficiency and increasing overall energy yields.[130]\nMultiple government-supported research organizations have focused on renewable energy in recent years. Two of the most prominent of these labs are Sandia National Laboratories and the National Renewable Energy Laboratory (NREL), both of which are funded by the United States Department of Energy and supported by various corporate partners.[131]\n Enhanced geothermal systems (EGS) are a new type of geothermal power technology that does not require natural convective hydrothermal resources. The vast majority of geothermal energy within drilling reach is in dry and non-porous rock.[132] EGS technologies \"enhance\" and/or create geothermal resources in this \"hot dry rock (HDR)\" through hydraulic fracturing. EGS and HDR technologies, such as hydrothermal geothermal, are expected to be baseload resources that produce power 24 hours a day like a fossil plant. Distinct from hydrothermal, HDR and EGS may be feasible anywhere in the world, depending on the economic limits of drill depth. Good locations are over deep granite covered by a thick (3–5 km or 1.9–3.1 mi) layer of insulating sediments which slow heat loss.[133] There are HDR and EGS systems currently being developed and tested in France, Australia, Japan, Germany, the U.S., and Switzerland. The largest EGS project in the world is a 25 megawatt demonstration plant currently being developed in the Cooper Basin, Australia. The Cooper Basin has the potential to generate 5,000–10,000 MW.\n Marine energy (also sometimes referred to as ocean energy) is the energy carried by ocean waves, tides, salinity, and ocean temperature differences. The movement of water in the world's oceans creates a vast store of kinetic energy, or energy in motion. This energy can be harnessed to generate electricity to power homes, transport and industries. The term marine energy encompasses wave power – power from surface waves, marine current power - power from marine hydrokinetic streams (e.g., the Gulf Stream), and tidal power – obtained from the kinetic energy of large bodies of moving water. Reverse electrodialysis (RED) is a technology for generating electricity by mixing fresh river water and salty sea water in large power cells designed for this purpose; as of 2016, it is being tested at a small scale (50 kW). Offshore wind power is not a form of marine energy, as wind power is derived from the wind, even if the wind turbines are placed over water. The oceans have a tremendous amount of energy and are close to many if not most concentrated populations. Ocean energy has the potential of providing a substantial amount of new renewable energy around the world.[134][135][page needed]\n Passive daytime radiative cooling (PDRC) uses the coldness of outer space as a renewable energy source to achieve daytime cooling that can be used in many applications,[139][140][141] such as indoor space cooling,[142][143] outdoor urban heat island mitigation,[144][145] and solar cell efficiency.[146][147] PDRC surfaces are designed to be high in solar reflectance to minimize heat gain and strong in longwave infrared (LWIR) thermal radiation heat transfer.[148] On a planetary scale, it has been proposed as a way to slow and reverse global warming.[138][149] PDRC applications are deployed as sky-facing surfaces, similar to other renewable energy sources such as photovoltaic systems and solar thermal collectors.[147] PDRC became possible with the ability to suppress solar heating using photonic metamaterials, first published in a study by Raman et al. to the scientific community in 2014.[146][150] PDRC applications for indoor space cooling is growing with an estimated \"market size of ~$27 billion in 2025.\"[151]\n Earth emits roughly 1017 W of infrared thermal radiation that flows toward the cold outer space. Solar energy hits the surface and atmosphere of the earth and produces heat. Using various theorized devices like emissive energy harvester (EEH) or thermoradiative diode, this energy flow can be converted into electricity. In theory, this technology can be used during nighttime.[152][153]\n Producing liquid fuels from oil-rich (fat-rich) varieties of algae is an ongoing research topic. Various microalgae grown in open or closed systems are being tried including some systems that can be set up in brownfield and desert lands.[154]\n Collection of static electricity charges from water droplets on metal surfaces is an experimental technology that would be especially useful in low-income countries with relative air humidity over 60%.[155]\n Breeder reactors could, in principle, extract almost all of the energy contained in uranium or thorium, decreasing fuel requirements by a factor of 100 compared to widely used once-through light water reactors, which extract less than 1% of the energy in the actinide metal (uranium or thorium) mined from the earth.[156] The high fuel-efficiency of breeder reactors could greatly reduce concerns about fuel supply, energy used in mining, and storage of radioactive waste. With seawater uranium extraction (currently too expensive to be economical), there is enough fuel for breeder reactors to satisfy the world's energy needs for 5 billion years at 1983's total energy consumption rate, thus making nuclear energy effectively a renewable energy.[157][158] In addition to seawater the average crustal granite rocks contain significant quantities of uranium and thorium that with breeder reactors can supply abundant energy for the remaining lifespan of the sun on the main sequence of stellar evolution.[159]\n Artificial photosynthesis uses techniques including nanotechnology to store solar electromagnetic energy in chemical bonds by splitting water to produce hydrogen and then using carbon dioxide to make methanol.[160] Researchers in this field strived to design molecular mimics of photosynthesis that use a wider region of the solar spectrum, employ catalytic systems made from abundant, inexpensive materials that are robust, readily repaired, non-toxic, stable in a variety of environmental conditions and perform more efficiently allowing a greater proportion of photon energy to end up in the storage compounds, i.e., carbohydrates (rather than building and sustaining living cells).[161] However, prominent research faces hurdles, Sun Catalytix a MIT spin-off stopped scaling up their prototype fuel-cell in 2012 because it offers few savings over other ways to make hydrogen from sunlight.[162]\n One of the efforts to decarbonize transportation is the increased use of electric vehicles (EVs).[163] Despite that and the use of biofuels, such as biojet, less than 4% of transport energy is from renewables.[164] Occasionally hydrogen fuel cells are used for heavy transport.[165] Meanwhile, in the future electrofuels may also play a greater role in decarbonizing hard-to-abate sectors like aviation and maritime shipping.[166]\n Solar water heating makes an important contribution to renewable heat in many countries, most notably in China, which now has 70% of the global total (180 GWth). Most of these systems are installed on multi-family apartment buildings[167] and meet a portion of the hot water needs of an estimated 50–60 million households in China. Worldwide, total installed solar water heating systems meet a portion of the water heating needs of over 70 million households.\n Heat pumps provide both heating and cooling, and also flatten the electric demand curve and are thus an increasing priority.[123] Renewable thermal energy is also growing rapidly.[168] About 10% of heating and cooling energy is from renewables.[169]\n Renewable energy production from some sources such as wind and solar is more variable and more geographically spread than technology based on fossil fuels and nuclear. While integrating it into the wider energy system is feasible, it does lead to some additional challenges such as increased production volatility and decreased system inertia.[170] Implementation of energy storage, using a wide variety of renewable energy technologies, and implementing a smart grid in which energy is automatically used at the moment it is produced can reduce risks and costs of renewable energy implementation.[170][171]: 15–16 \n Sector coupling of the power generation sector with other sectors may increase flexibility: for example the transport sector can be coupled by charging electric vehicles and sending electricity from vehicle to grid.[172] Similarly the industry sector can be coupled by hydrogen produced by electrolysis,[173] and the buildings sector by thermal energy storage for space heating and cooling.[174]\n Electrical energy storage is a collection of methods used to store electrical energy. Electrical energy is stored during times when production (especially from intermittent sources such as wind power, tidal power, solar power) exceeds consumption, and returned to the grid when production falls below consumption. Pumped-storage hydroelectricity accounts for more than 85% of all grid power storage.[175] Batteries are increasingly being deployed for storage[176] and grid ancillary services[177] and for domestic storage.[178] Green hydrogen is a more economical means of long-term renewable energy storage, in terms of capital expenditures compared to pumped hydroelectric or batteries.[179][180]\n Most new renewables are solar, followed by wind then hydro then bioenergy.[181] Investment in renewables, especially solar, tends to be more effective in creating jobs than coal, gas or oil.[182][183] Worldwide, renewables employ about 12 million people as of 2020, with solar PV being the technology employing the most at almost 4 million.[184] However, as of February 2024, the world's supply of workforce for solar energy is lagging greatly behind demand as universities worldwide still produce more workforce for fossil fuels than for renewable energy industries.[185]\n The International Renewable Energy Agency (IRENA) stated that ~86% (187 GW) of renewable capacity added in 2022 had lower costs than electricity generated from fossil fuels.[186] IRENA also stated that capacity added since 2000 reduced electricity bills in 2022 by at least $520 billion, and that in non-OECD countries, the lifetime savings of 2022 capacity additions will reduce costs by up to $580 billion.[186]\n * = 2018. All other values for 2019.\n The results of a recent review of the literature concluded that as greenhouse gas (GHG) emitters begin to be held liable for damages resulting from GHG emissions resulting in climate change, a high value for liability mitigation would provide powerful incentives for deployment of renewable energy technologies.[201]\n In the decade of 2010–2019, worldwide investment in renewable energy capacity excluding large hydropower amounted to US$2.7 trillion, of which the top countries China contributed US$818 billion, the United States contributed US$392.3 billion, Japan contributed US$210.9 billion, Germany contributed US$183.4 billion, and the United Kingdom contributed US$126.5 billion.[202] This was an increase of over three and possibly four times the equivalent amount invested in the decade of 2000–2009 (no data is available for 2000–2003).[202]\n As of 2022, an estimated 28% of the world's electricity was generated by renewables. This is up from 19% in 1990.[203]\n A December 2022 report by the IEA forecasts that over 2022-2027, renewables are seen growing by almost 2 400 GW in its main forecast, equal to the entire installed power capacity of China in 2021. This is an 85% acceleration from the previous five years, and almost 30% higher than what the IEA forecast in its 2021 report, making its largest ever upward revision. Renewables are set to account for over 90% of global electricity capacity expansion over the forecast period.[69] To achieve net zero emissions by 2050, IEA believes that 90% of global electricity generation will need to be produced from renewable sources.[24]\n In June 2022 IEA Executive Director Fatih Birol said that countries should invest more in renewables to \"ease the pressure on consumers from high fossil fuel prices, make our energy systems more secure, and get the world on track to reach our climate goals.”[205]\n China's five year plan to 2025 includes increasing direct heating by renewables such as geothermal and solar thermal.[206]\n REPowerEU, the EU plan to escape dependence on fossil Russian gas, is expected to call for much more green hydrogen.[207]\n After a transitional period,[208] renewable energy production is expected to make up most of the world's energy production. In 2018, the risk management firm, DNV GL, forecasts that the world's primary energy mix will be split equally between fossil and non-fossil sources by 2050.[209]\n In July 2014, WWF and the World Resources Institute convened a discussion among a number of major US companies who had declared their intention to increase their use of renewable energy. These discussions identified a number of \"principles\" which companies seeking greater access to renewable energy considered important market deliverables. These principles included choice (between suppliers and between products), cost competitiveness, longer term fixed price supplies, access to third-party financing vehicles, and collaboration.[210]\n UK statistics released in September 2020 noted that \"the proportion of demand met from renewables varies from a low of 3.4 per cent (for transport, mainly from biofuels) to highs of over 20 per cent for 'other final users', which is largely the service and commercial sectors that consume relatively large quantities of electricity, and industry\".[211]\n In some locations, individual households can opt to purchase renewable energy through a consumer green energy program.\n Renewable energy in developing countries is an increasingly used alternative to fossil fuel energy, as these countries scale up their energy supplies and address energy poverty. Renewable energy technology was once seen as unaffordable for developing countries.[212] However, since 2015, investment in non-hydro renewable energy has been higher in developing countries than in developed countries, and comprised 54% of global renewable energy investment in 2019.[213] The International Energy Agency forecasts that renewable energy will provide the majority of energy supply growth through 2030 in Africa and Central and South America, and 42% of supply growth in China.[214]\n In Kenya, the Olkaria V Geothermal Power Station is one of the largest in the world.[216] The Grand Ethiopia Renaissance Dam project incorporates wind turbines.[217] Once completed, Morocco's Ouarzazate Solar Power Station is projected to provide power to over a million people.[218]\n Policies to support renewable energy have been vital in their expansion. Where Europe dominated in establishing energy policy in the early 2000s, most countries around the world now have some form of energy policy.[219]\n The International Renewable Energy Agency (IRENA) is an intergovernmental organization for promoting the adoption of renewable energy worldwide. It aims to provide concrete policy advice and facilitate capacity building and technology transfer. IRENA was formed in 2009, with 75 countries signing the charter of IRENA.[220] As of April 2019, IRENA has 160 member states.[221] The then United Nations Secretary-General Ban Ki-moon has said that renewable energy can lift the poorest nations to new levels of prosperity,[222] and in September 2011 he launched the UN Sustainable Energy for All initiative to improve energy access, efficiency and the deployment of renewable energy.[223]\n The 2015 Paris Agreement on climate change motivated many countries to develop or improve renewable energy policies.[23] In 2017, a total of 121 countries adopted some form of renewable energy policy.[219] National targets that year existed in 176 countries.[23] In addition, there is also a wide range of policies at the state/provincial, and local levels.[111] Some public utilities help plan or install residential energy upgrades.\n Many national, state and local governments have created green banks. A green bank is a quasi-public financial institution that uses public capital to leverage private investment in clean energy technologies.[224] Green banks use a variety of financial tools to bridge market gaps that hinder the deployment of clean energy.\n Climate neutrality by the year 2050 is the main goal of the European Green Deal.[225] For the European Union to reach their target of climate neutrality, one goal is to decarbonise its energy system by aiming to achieve \"net-zero greenhouse gas emissions by 2050.\"[226]\n 100% renewable energy is the goal of the use renewable resources for all energy. 100% renewable energy for electricity, heating, cooling and transport is motivated by climate change, pollution and other environmental issues, as well as economic and energy security concerns. Shifting the total global primary energy supply to renewable sources requires a transition of the energy system, since most of today's energy is derived from non-renewable fossil fuels.\n Research into this topic is fairly new, with very few studies published before 2009, but has gained increasing attention in recent years. The majority of studies show that a global transition to 100% renewable energy across all sectors – power, heat, transport and industry – is feasible and economically viable.[227][228][229][230][need quotation to verify] A cross-sectoral, holistic approach is seen as an important feature of 100% renewable energy systems and is based on the assumption \"that the best solutions can be found only if one focuses on the synergies between the sectors\" of the energy system such as electricity, heat, transport or industry.[231]\n The International Renewable Energy Agency's (IRENA) 2023 report on renewable energy finance highlights steady investment growth since 2018: USD 348 billion in 2020 (a 5.6% increase from 2019), USD 430 billion in 2021 (24% up from 2020), and USD 499 billion in 2022 (16% higher). This trend is driven by increasing recognition of renewable energy's role in mitigating climate change and enhancing energy security, along with investor interest in alternatives to fossil fuels. Policies such as feed-in tariffs in China and Vietnam have significantly increased renewable adoption. Furthermore, from 2013 to 2022, installation costs for solar photovoltaic (PV), onshore wind, and offshore wind fell by 69%, 33%, and 45%, respectively, making renewables more cost-effective.[234][235]\n From 2020 to 2022, solar technology investments almost doubled from USD 162 billion to USD 308 billion, driven by the sector's increasing maturity and cost reductions, particularly in solar photovoltaic (PV), which accounted for 90% of total investments. China and the United States were the main recipients, collectively making up about half of all solar investments since 2013. Despite reductions in Japan and India due to policy changes and COVID-19, growth in China, the United States, and a significant increase from Vietnam's feed-in tariff program offset these declines. Globally, the solar sector added 714 gigawatts (GW) of solar PV and concentrated solar power (CSP) capacity between 2013 and 2021, with a notable rise in large-scale solar heating installations in 2021, especially in China, Europe, Turkey, and Mexico.[235]\n Investments in wind technologies reached USD 161 billion in 2020, with onshore wind dominating at 80% of total investments from 2013 to 2022. Offshore wind investments nearly doubled to USD 41 billion between 2019 and 2020, primarily due to policy incentives in China and expansion in Europe. Global wind capacity increased by 557 GW between 2013 and 2021, with capacity additions increasing by an average of 19% each year.[235]\n Between 2013 and 2022, the renewable energy sector underwent a significant realignment of investment priorities. Investment in solar and wind energy technologies markedly increased. In contrast, other renewable technologies such as hydropower (including pumped storage hydropower), biomass, biofuels, geothermal, and marine energy experienced a substantial decrease in financial investment. Notably, from 2017 to 2022, investment in these alternative renewable technologies declined by 45%, falling from USD 35 billion to USD 17 billion.[235]\n Renewable electricity generation by wind and solar is variable. This results in reduced capacity factor and may require keeping some gas-fired power plants or other dispatchable generation on standby[238][239][240] until there is enough energy storage, demand response, grid improvement, and/or base load power from non-intermittent sources like hydropower, nuclear power or bioenergy.\n The market for renewable energy technologies has continued to grow. Climate change concerns and increasing in green jobs, coupled with high oil prices, peak oil, oil wars, oil spills, promotion of electric vehicles and renewable electricity, nuclear disasters and increasing government support, are driving increasing renewable energy legislation, incentives and commercialization.[30][better source needed]\n The International Energy Agency has stated that deployment of renewable technologies usually increases the diversity of electricity sources and, through local generation, contributes to the flexibility of the system and its resistance to central shocks.[241]\n Solar power plants may compete with arable land,[243][244] while on-shore wind farms face opposition due to aesthetic concerns and noise, which is impacting both humans and wildlife.[245][246][247][need quotation to verify]In the United States, the Massachusetts Cape Wind project was delayed for years partly because of aesthetic concerns. However, residents in other areas have been more positive. According to a town councilor, the overwhelming majority of locals believe that the Ardrossan Wind Farm in Scotland has enhanced the area.[248] These concerns, when directed against renewable energy, are sometimes described as \"not in my back yard\" attitude (NIMBY).\n A 2011 UK Government document states that \"projects are generally more likely to succeed if they have broad public support and the consent of local communities. This means giving communities both a say and a stake\".[249] In countries such as Germany and Denmark many renewable projects are owned by communities, particularly through cooperative structures, and contribute significantly to overall levels of renewable energy deployment.[250][251]\n Whether nuclear power should be considered a form of renewable energy is an ongoing subject of debate. Statutory definitions of renewable energy usually exclude many present nuclear energy technologies, with the notable exception of the state of Utah.[252] Dictionary-sourced definitions of renewable energy technologies often omit or explicitly exclude mention of nuclear energy sources, with an exception made for the natural nuclear decay heat generated within the Earth.[253][254]\n The most common fuel used in conventional nuclear fission power stations, uranium-235 is \"non-renewable\" according to the Energy Information Administration, the organization however is silent on the recycled MOX fuel.[254] The National Renewable Energy Laboratory does not mention nuclear power in its \"energy basics\" definition.[255]\n The geopolitical impact of the growing use of renewable energy is a subject of ongoing debate and research.[258] Many fossil-fuel producing countries, such as Qatar, Russia, Saudi Arabia and Norway, are currently able to exert diplomatic or geopolitical influence as a result of their oil wealth. Most of these countries are expected to be among the geopolitical \"losers\" of the energy transition, although some, like Norway, are also significant producers and exporters of renewable energy. Fossil fuels and the infrastructure to extract them may, in the long term, become stranded assets.[259] It has been speculated that countries dependent on fossil fuel revenue may one day find it in their interests to quickly sell off their remaining fossil fuels.[260]\n Conversely, nations abundant in renewable resources, and the minerals required for renewables technology, are expected to gain influence.[261][262] In particular, China has become the world's dominant manufacturer of the technology needed to produce or store renewable energy, especially solar panels, wind turbines, and lithium-ion batteries.[263] Nations rich in solar and wind energy could become major energy exporters.[264] Some may produce and export green hydrogen,[265][264] although electricity is projected to be the dominant energy carrier in 2050, accounting for almost 50% of total energy consumption (up from 22% in 2015).[266] Countries with large uninhabited areas such as Australia, China, and many African and Middle Eastern countries have a potential for huge installations of renewable energy. The production of renewable energy technologies requires rare-earth elements with new supply chains.[267]\n Countries with already weak governments that rely on fossil fuel revenue may face even higher political instability or popular unrest. Analysts consider Nigeria, Angola, Chad, Gabon, and Sudan, all countries with a history of military coups, to be at risk of instability due to dwindling oil income.[268]\n A study found that transition from fossil fuels to renewable energy systems reduces risks from mining, trade and political dependence because renewable energy systems don't need fuel – they depend on trade only for the acquisition of materials and components during construction.[269]\n In October 2021, European Commissioner for Climate Action Frans Timmermans suggested \"the best answer\" to the 2021 global energy crisis is \"to reduce our reliance on fossil fuels.\"[270] He said those blaming the European Green Deal were doing so \"for perhaps ideological reasons or sometimes economic reasons in protecting their vested interests.\"[270] Some critics blamed the European Union Emissions Trading System (EU ETS) and closure of nuclear plants for contributing to the energy crisis.[271][272][273] European Commission President Ursula von der Leyen said that Europe is \"too reliant\" on natural gas and too dependent on natural gas imports. According to Von der Leyen, \"The answer has to do with diversifying our suppliers ... and, crucially, with speeding up the transition to clean energy.\"[274]\n The renewable energy transition requires increased extraction of certain metals and minerals.[275] Solar power panels require large amounts of aluminum.[276] This impacts the environment and can lead to environmental conflict.[277]\n The International Energy Agency does not recognise shortages of resources but states that supply could struggle to keep pace with the world's climate ambitions. Electric vehicles (EV) and battery storage are expected to cause the most demand. Wind farms and solar PV are less consuming. The extension of electrical grids requires large amounts of copper and aluminium. The IEA recommends to scale up recycling. By 2040, quantities of copper, lithium, cobalt, and nickel from spent batteries could reduce combined primary supply requirements for these minerals by around 10%.[275]\n The demand for lithium by 2040 is expected to grow by the factor of 42. Graphite and nickel exploration is predicted to grow about 20-fold. For each of the most relevant minerals and metals, a significant share of resources are concentrated in only one country: copper in Chile, nickel in Indonesia, rare earths in China, cobalt in the Democratic Republic of the Congo (DRC), and lithium in Australia. China dominates processing of them all.[275]\n A controversial approach is deep sea mining. Minerals can be collected from new sources like polymetallic nodules lying on the seabed,[278] but this could damage biodiversity.[279]\n Moving to modern renewable energy has very large health benefits due to reducing air pollution from fossil fuels.[280][281][282][283][284][285]\n Renewable sources other than biomass such as wind power, photovoltaics, and hydroelectricity have the advantage of being able to conserve water, lower pollution[286] and reduce CO2 emissions.\n Solar panels change the albedo of the surface, so if used on a very large scale (such as covering 20% of the Sahara Desert), could change global weather patterns.[287]\n Installations used to produce wind, solar and hydropower are an increasing threat to key conservation areas, with facilities built in areas set aside for nature conservation and other environmentally sensitive areas. They are often much larger than fossil fuel power plants, needing areas of land up to 10 times greater than coal or gas to produce equivalent energy amounts.[288] More than 2000 renewable energy facilities are built, and more are under construction, in areas of environmental importance and threaten the habitats of plant and animal species across the globe. The authors' team emphasized that their work should not be interpreted as anti-renewables because renewable energy is crucial for reducing carbon emissions. The key is ensuring that renewable energy facilities are built in places where they do not damage biodiversity.[289]\n The transition to renewable energy depends on non-renewable resources, such as mined metals.[243] Manufacturing of photovoltaic panels, wind turbines and batteries requires significant amounts of rare-earth elements[290] which has significant social and environmental impact if mined in forests and protected areas.[291] Due to co-occurrence of rare-earth and radioactive elements (thorium, uranium and radium), rare-earth mining results in production of low-level radioactive waste.[292] In Africa, the green energy transition created a mining boom, causing deforestation and creating possibility to zoonotic spillover. To mitigate climate change and prevent epidemics some territories should stay intact.[293]\n In 2020 scientists published a world map of areas that contain renewable energy materials as well as estimations of their overlaps with \"Key Biodiversity Areas\", \"Remaining Wilderness\" and \"Protected Areas\". The authors assessed that careful strategic planning is needed.[294][295][296] Solar panels are recycled to reduce electronic waste and create a source for materials that would otherwise need to be mined,[297] but such business is still small and work is ongoing to improve and scale-up the process.[298][299][300]\n Prior to the development of coal in the mid 19th century, nearly all energy used was renewable. The oldest known use of renewable energy, in the form of traditional biomass to fuel fires, dates from more than a million years ago. The use of biomass for fire did not become commonplace until many hundreds of thousands of years later.[301] Probably the second oldest usage of renewable energy is harnessing the wind in order to drive ships over water. This practice can be traced back some 7000 years, to ships in the Persian Gulf and on the Nile.[302] From hot springs, geothermal energy has been used for bathing since Paleolithic times and for space heating since ancient Roman times.[303] Moving into the time of recorded history, the primary sources of traditional renewable energy were human labor, animal power, water power, wind, in grain crushing windmills, and firewood, a traditional biomass.\n In 1885, Werner Siemens, commenting on the discovery of the photovoltaic effect in the solid state, wrote:\n In conclusion, I would say that however great the scientific importance of this discovery may be, its practical value will be no less obvious when we reflect that the supply of solar energy is both without limit and without cost, and that it will continue to pour down upon us for countless ages after all the coal deposits of the earth have been exhausted and forgotten.[304] Max Weber mentioned the end of fossil fuel in the concluding paragraphs of his Die protestantische Ethik und der Geist des Kapitalismus (The Protestant Ethic and the Spirit of Capitalism), published in 1905.[305] Development of solar engines continued until the outbreak of World War I. The importance of solar energy was recognized in a 1911 Scientific American article: \"in the far distant future, natural fuels having been exhausted [solar power] will remain as the only means of existence of the human race\".[306]\n The theory of peak oil was published in 1956.[307] In the 1970s environmentalists promoted the development of renewable energy both as a replacement for the eventual depletion of oil, as well as for an escape from dependence on oil, and the first electricity-generating wind turbines appeared. Solar had long been used for heating and cooling, but solar panels were too costly to build solar farms until 1980.[308]\n New government spending, regulation and policies helped the industry weather the 2009 economic crisis better than many other sectors.[44]"
    },
    "10": {
        "document_name": "Renewable_energy_in_the_United_Kingdom.html",
        "content": "Renewable energy in the United Kingdom contributes to production for electricity, heat, and transport.\n From the mid-1990s, renewable energy began to play a part in the UK's electricity generation, building on a small hydroelectric capacity. Wind power, which is abundant in the UK, has since become the main source of renewable energy. As of 2022[update], renewable sources generated 41.8% of the electricity produced in the UK;[2] around 6% of total UK energy usage. Q4 2022 statistics are similar, with low carbon electricity generation (which includes nuclear) at 57.9% of total electricity generation (same as Q4 2021).[3]\n Wind energy production was 26,000 GWh in Q4 2022 (from 2,300 GWh in Q1 2010), and the installed capacity of 29,000 MW (5,000 in 2010)[4] ranked the UK 6th in the world in 2022.\n In 2022, bioenergy comprised 63% of the renewable energy sources utilized in the UK, with wind accounting for the majority of the remaining share at 26%, while heat pumps and solar each contributed approximately 4.4%.[2]\n Interest has increased in recent years due to UK and EU targets for reductions in carbon emissions, and government incentives for renewable electricity such as the Renewable Obligation Certificate scheme (ROCs) and feed in tariffs (FITs), as well as for renewable heat such as the Renewable Heat Incentive.  The 2009 EU Renewables Directive established a target of 15% reduction in total energy consumption in the UK by 2020. The UK is aiming to reach net zero by 2050.[5]\n Heat from wood fires goes back to the earliest human habitation of Britain.[6][7]\n Waterwheel technology was imported by the Romans, with sites in Ikenham and Willowford in England being from the 2nd century AD.[8] At the time of the Domesday Book (1086), there were 5,624 watermills in England alone, almost all of them located by modern archaeological surveys,[9] which suggest a higher of 6,082, with many others likely unrecorded in the northern reaches of England.[10] By 1300, this number had risen to between 10,000 and 15,000.[11]\n Windmills first appeared in Europe during the Middle Ages. The earliest reliable reference to a windmill in Europe (assumed to have been of the vertical type) dates from 1185, in the former village of Weedley in Yorkshire, at the southern tip of the Wold overlooking the Humber Estuary.[12] The first electricity-generating wind turbine was a battery charging machine installed in July 1887 by Scottish academic James Blyth to light his holiday home in Marykirk, Scotland.[13]\n In 1878, the world's first hydroelectric power scheme was developed at Cragside in Northumberland, England by William George Armstrong. It was used to power a single arc lamp in his art gallery.[14]\n However, almost all electricity generation thereafter was based on burning coal. In 1964, coal accounted for 88% of electricity, and oil for 11%.[15] The remainder was mostly hydroelectric power, which continued to grow its share as coal struggled to meet demand. The world's third pumped-storage hydroelectric power station, the Cruachan Dam in Argyll and Bute, Scotland, came on line in 1967.[16] The Central Electricity Generating Board attempted to experiment with wind energy on the Llŷn Peninsula in Wales during the 1950s, but this was shelved after local opposition.[15]\n Renewable energy experienced a turning point in the 1970s, with the 1973 oil crisis, the 1972 miners' strike, growing environmentalism, and wind energy development in the United States exerting pressure on the government. In 1974, the Central Policy Review Staff recommended that ‘the first stage of a full technical and economic appraisal of harnessing wave power for electricity generation should be put in hand at once.’ Wave power was seen to be the future of the nation's energy policy, and solar, wind, and tidal schemes were dismissed as 'impractical'. Nevertheless, an alternative energy research centre was opened in Harwell, although it was criticised for favouring nuclear power. By 1978, four wave energy generator prototypes had been designed which were later deemed too expensive. The Wave Energy Programme closed in the same year.[15]\n During this period, there was a large increase in installations of solar thermal collectors to heat water. In 1986, Southampton began pumping heat from a geothermal borehole through a district heating network. Over the years, several combined heat and power (CHP) engines and backup boilers for heating have been added, along with absorption chillers and backup vapour compression machines for cooling.[19]\n In 1987 a 3.7 MW demonstration wind turbine on Orkney began supplying electricity to homes, the largest in Britain at the time. Privatisation of the energy sector in 1989 ended direct governmental research funding. Two years later the UK's first onshore windfarm was opened in Delabole, Cornwall: ten turbines producing enough energy for 2,700 homes. This was followed by the UK's first offshore windfarm in North Hoyle, Wales.[20]\n The share of renewables in the country's electricity generation has risen from below 2% in 1990 to 14.9% in 2013, helped by subsidy and falling costs. Introduced on 1 April 2002, the Renewables Obligation requires all electricity suppliers who supply electricity to end consumers to supply a set portion of their electricity from eligible renewables sources; a proportion that would increase each year until 2015 from a 3% requirement in 2002–2003, via 10.4% in 2010–2012 up to 15.4% by 2015–2016. The UK Government announced in the 2006 Energy Review an additional target of 20% by 2020–21. For each eligible megawatt hour of renewable energy generated, a tradable certificate called a Renewables obligation certificate (ROC) is issued by Ofgem.\n In 2007, the United Kingdom Government agreed to an overall European Union target of generating 20% of the EU's energy supply from renewable sources by 2020. Each EU member state was given its own allocated target; for the United Kingdom it was 15%. This was formalised in January 2009 with the passage of the EU Renewables Directive. As renewable heat and fuel production in the United Kingdom were at extremely low bases, RenewableUK estimated that this would require 35–40% of the UK's electricity to be generated from renewable sources by that date,[21] to be met largely by 33–35 GW of installed wind capacity. The 2008 Climate Change Act consists of a commitment to reducing net Greenhouse Gas Emissions by 80% by 2050 (on 1990 levels) and an intermediate target reduction of 26% by 2020.\n The Green Deal was UK government policy from 2012 to 2015. It permitted loans for energy saving measures for properties in Great Britain to enable consumers to benefit from energy efficient improvements to their home.\n In 2013, renewable sources provided 14.9% of the electricity generated in the United Kingdom,[22] reaching 53.7 TWh of electricity generated. In the second quarter of 2015, renewable electricity generation exceeded 25% and exceeded coal generation for the first time.[23]\n In 2013, renewable sources accounted for 5.2% of all energy produced, using the methodology of the 2009 Renewables Directive.[22] By 2015, this had risen to 8.3%.[24]\n In June 2017, for the first time renewables plus nuclear generated more UK power than gas and coal together. Britain had the fourth greenest power generation in Europe and the seventh worldwide. In that year, new offshore wind power became cheaper than new nuclear power for the first time.[25]\n Government figures for December 2020 showed renewable sources generated 41.4% of the electricity produced in the UK,[26] being around 6% of total UK energy usage. Q4 2022 statistics were similar, with low carbon electricity generation (which includes nuclear) at 57.9 per cent of total electricity generation (same as Q4 2021).[3]\n From 2020, a rapid expansion of grid scale battery storage took place, helping to cope with the variability in wind and solar power. As of May 2021[update], 1.3 GW of grid storage batteries was active,[27][28] along with the earlier pumped storage at Dinorwig, Cruachan and Ffestiniog.\n For comparison, CCGT (combined cycle gas turbine) without carbon capture or carbon costs had an estimated cost in 2020 of 4.7 pence/kWh (£47/MWh).[30] Offshore wind prices dropped far faster than the forecasts predicted, and in 2017 two offshore wind farm bids were made at a cost of 5.75 pence/kWh (£57.50/MWh) for construction by 2022–2023.[32]\n The \"strike price\" forms the basis of the Contract for Difference between the 'generator and the Low Carbon Contracts Company (LCCC), a government-owned company'[33] and guarantees the price per MWh paid to the electricity producer. It is not the same as the levelised cost of electricity (LCOE) which is a first order estimate of the average cost the producer must receive to break-even.\n Low-carbon generation sources have agreed \"strike prices\" in the range £50-£79.23/MWh for photovoltaic, £80/MWh for energy from waste, £79.23-£82.5/MWh for onshore wind, and £114.39-£119.89/MWh for offshore wind and conversion technologies (all expressed in 2012 prices).[34][35] These prices are indexed to inflation.[36]\n With new interconnectors, specifically the ongoing construction of the NSN Link is expected to finish in 2020 after which the UK will get 1.4 GW of access to less expensive sources in the south Norway bidding area (NO2) of Nord Pool Spot.[37]  Similarly, Viking Link is expected to start operations in 2022,[38] after which the UK will get another 1.4 GW of access to the less expensive west Denmark bidding area (DK1) of Nord Pool Spot.\n Wind power delivers a growing fraction of the energy in the United Kingdom. By the beginning of February 2020, wind power production consisted of 10,429 wind turbines with a total installed capacity of over 22 GW: 13,575 MW of onshore capacity and 8,483 MW of offshore capacity,[39] having risen from  7,950 MW onshore and 4,049 MW offshore since 2015 [40] The UK is ranked as the world's sixth largest producer of wind power, having overtaken France and Italy in 2012.[41]\n Polling of public opinion consistently shows strong support for wind power in the UK, with nearly three-quarters of the population agreeing with its use, even among those living near onshore wind turbines. Wind power is expected to continue growing in the UK for the foreseeable future. Within the UK, wind power is the second largest source of renewable energy after biomass.[22] As of 2018[update], Ørsted (formerly DONG Energy) is the UK's largest windfarm operator with stakes in planned or existing projects able to produce 5 GW of wind energy.\n 2010 saw the completion of significant projects in the UK wind industry with the Gunfleet Sands, Robin Rigg[42] and Thanet[43] offshore wind farms coming on-stream.\n Due to the island location of the UK, the country has great potential for generating electricity from wave power and tidal power.\n To date, wave and tidal power have received very little money for development and consequently have not yet been exploited on a significant commercial basis due to doubts over their economic viability in the UK.[44] The European Marine Energy Centre in Orkney operates a grid connected wave power scheme at Billia Croo outside Stromness and a grid connected tidal test site in a narrow channel between the Westray Firth and Stronsay Firth.[45]\n Funding for the UK's first wave farm was announced by then Scottish Executive in February 2007. It will be the world's largest, with a capacity of 3 MW generated by four Pelamis machines and a cost of over £4 million.[46] In the south of Scotland, investigations have taken place into a tidal power scheme involving the construction of a Solway Barage, possibly located south of Annan.\n A wave farm project to harness wave power, using the PB150 PowerBuoy has been completed by Ocean Power Technologies in Scotland and is under development off Cornwall at Wave Hub.\n Gas from sewage and landfill (biogas) has already been exploited in some areas. In 2004, it provided 129.3 GW·h (up 690% from 1990 levels), and was the UK's leading renewable energy source, representing 39.4% of all renewable energy produced (including hydro).[47] The UK has committed to a target of 10.3% of renewable energy in transport to comply with the Renewable Energy Directive of the European Union but has not yet implemented legislation Archived 17 May 2016 at the Portuguese Web Archive to meet this target.\n Other biofuels can provide a close-to-carbon-neutral energy source, if locally grown. In South America and Asia, the production of biofuels for export has in some cases resulted in significant ecological damage, including the clearing of rainforest. In 2004, biofuels provided 105.9 GW·h, 38% of it wood. This represented an increase of 500% from 1990.[48]\n At the end of 2011, there were 230,000 solar power projects in the United Kingdom,[49] with a total installed generating capacity of 750 MW.[50] By February 2012 the installed capacity had reached 1,000 MW.[51] Solar power use has increased very rapidly in recent years, albeit from a small base, as a result of reductions in the cost of photovoltaic (PV) panels, and the introduction of a Feed-in tariff (FIT) subsidy in April 2010.[49] In 2012, the government said that 4 million homes across the UK will be powered by the sun within eight years,[52] representing a target of 22 GW of installed solar power capacity by 2020.[49] By February 2019, approximately 13 GW had been installed. [53] The FIT program closed to new applicants at the end of March 2019.[2]\n As of 2012, hydroelectric power stations in the United Kingdom accounted for 1.67 GW of installed electrical generating capacity, being 1.9% of the UK's total generating capacity and 14% of UK's renewable energy generating capacity. Annual electricity production from such schemes is approximately 5,700 GWh, being about 1.5% of the UK's total electricity production.[54]\n There are also pumped-storage power stations in the UK. These power stations are net consumers of electrical energy however they contribute to balancing the grid, which can facilitate renewable generation elsewhere, for example by 'soaking up' surplus renewable output at off-peak times and release the energy when it is required.\n Investigations into the exploitation of Geothermal power in the United Kingdom, prompted by the 1973 oil crisis, were abandoned as fuel prices fell.[citation needed] Only one scheme is operational, in Southampton.[citation needed] In 2009, planning permission was granted for a geothermal scheme near Eastgate, County Durham, but funding was withdrawn and as of August 2017[update] there has been no further progress.[55][56] In November 2018, drilling started for a plant planning permission for a commercial-scale geothermal power plant on the United Downs industrial estate near Redruth by Geothermal Engineering. The plant will produce 3 MW of renewable electricity.[57][58] In December 2010, the Eden Project in Cornwall was given permission to build a Hot Rock Geothermal Plant. This was completed in June 2023.[59][60] This was the first deep geothermal heating plant built in Britain since 1987 and cost £24 million in total.[61]\n Microgeneration technologies are seen as having considerable potential by the Government. However, the microgeneration strategy launched in March 2006[62] was seen as a disappointment by many commentators.[63] Microgeneration involves the local production of electricity by homes and businesses from low-energy sources including small scale wind turbines, and solar electricity installations. The Climate Change and Sustainable Energy Act 2006[64] is expected to boost the number of microgeneration installations,[65] however, funding for grants under the Low Carbon Building Programme is proving insufficient to meet demand with funds for March 2007 being spent in 75 minutes.[66]\n Sustainable community energy systems, pioneered by Woking Borough Council, provide an integrated approach to using cogeneration, renewables and other technologies to provide sustainable energy supplies to an urban community. It is expected that the same approach will be developed in other towns and cities, including London.[67] Highlands and Islands Community Energy Company based in Inverness are active in developing community-owned and led initiatives in Scotland.[68]\n An energy positive house was built in Wales for £125,000 in July 2015. It is expected to generate £175 in electricity export for each £100 spent on electricity.[69]"
    },
    "11": {
        "document_name": "Renewable_energy_in_the_United_States.html",
        "content": "Renewable energy sources in 2022. Renewables were 8.4% of total energy, or 8.3 quads.[1]\n Renewable electricity sources in 2022. Renewables were 21% of total electricity, or 907 TWh.[2]\n According to data from the US Energy Information Administration, renewable energy accounted for 8.4% of total primary energy production[1] and 21% of total utility-scale electricity generation in the United States in 2022.[3]\n Since 2019, wind power has been the largest producer of renewable electricity in the country. Wind power generated 434 terawatt-hours of electricity in 2022, which accounted for 10% of the nation's electricity and 48% of renewable generation.[2] By January 2023, the United States nameplate generating capacity for wind power was 141.3 gigawatts (GW).[4] Texas remained firmly established as the leader in wind power deployment, followed by Iowa and Oklahoma as of the first quarter of 2023.[5]\n Hydroelectric power is the second-largest producer of renewable electricity in the country, generating around 6.2% of the nation's electricity in 2022 as well as 29% of renewable generation.[2]\nThe United States is the fourth largest producer of hydroelectricity in the world after China, Canada and Brazil.\n Solar power provides a growing share of electricity in the country, with over 111.6 GW of installed capacity generating about 3.4% of the country's total electricity supply in 2022, up from 2.8% the previous year. As of 2020, more than 260,000 people worked in the solar industry and 43 states deployed net metering, where energy utilities bought back excess power generated by solar arrays.[6][7] Large photovoltaic power plants in the United States include Mount Signal Solar (600 MW) and Solar Star (579 MW). Since the United States pioneered solar thermal power technology in the 1980s with Solar One, several more such power stations have been built. The largest of these solar thermal power stations are the Ivanpah Solar Power Facility (392 MW), southwest of Las Vegas, and the SEGS group of plants in the Mojave Desert, with a total generating capacity of 354 MW.[8]\n Other renewable energy sources include geothermal, with The Geysers in Northern California the largest geothermal complex in the world.\n The development of renewable energy and energy efficiency marked \"a new era of energy exploration\" in the United States, according to former President Barack Obama.[9] In a joint address to the Congress on February 24, 2009, President Obama called for doubling renewable energy within the following three years. Renewable energy reached a major milestone in the first quarter of 2011, when it contributed 11.7% of total national energy production (660 TWh), surpassing energy production from nuclear power (620 TWh)[10] for the first time since 1997.[11]\nIn his 2012 State of the Union address, President Barack Obama restated his commitment to renewable energy and mentioned the long-standing Interior Department commitment to permit 10 GW of renewable energy projects on public land in 2012.[12] Under President Joe Biden, Congress increased that goal to 25 GW by 2025.[13] As of May 2023, the Bureau of Land Management has approved projects meeting approximately 37% of that goal.[14]\n Renewable energy technologies encompass a broad, diverse array of technologies, including solar photovoltaics, solar thermal power plants and heating/cooling systems, wind farms, hydroelectricity, geothermal power plants, and ocean power systems and the use of biomass.\n The report Outlook On Renewable Energy In America explains that America needs renewable energy, for many reasons:\n America needs energy that is secure, reliable, improves public health, protects the environment, addresses climate change, creates jobs, and provides technological leadership. America needs renewable energy. If renewable energy is to be developed to its full potential, America will need coordinated, sustained federal and state policies that expand renewable energy markets; promote and deploy new technology; and provide appropriate opportunities to encourage renewable energy use in all critical energy market sectors: wholesale and distributed electricity generation, thermal energy applications, and transportation.[15]\n Another benefit of some renewable energy technologies, like wind and solar photovoltaics (PV) is that they require little or no water to generate electricity whereas thermoelectric (fossil fuel-based) power plants require vast amounts of water for operation.\n In 2009, President Barack Obama in the inaugural address called for the expanded use of renewable energy to meet the twin challenges of energy security and climate change. Those were the first references ever to the nation's energy use, to renewable resources, and to climate change in an inauguration speech of a United States president. President Obama looked to the near future, saying that as a nation, the United States will \"harness the sun and the winds and the soil to fuel our cars and run our factories.\"[16]\n The president's New Energy For America plan calls for a federal investment of $150 billion over the next decade to catalyze private efforts to build a clean energy future. Specifically, the plan calls for renewable energy to supply 10% of the nation's electricity by 2012, rising to 25% by 2025.[16]\n In his joint address to Congress in 2009, Obama stated that: \"We know the country that harnesses the power of clean, renewable energy will lead the 21st century.... Thanks to our recovery plan, we will double this nation’s supply of renewable energy in the next three years... It is time for America to lead again\".[17]\n As of 2011, new evidence has emerged that there are considerable risks associated with traditional energy sources, and that major changes to the mix of energy technologies is needed: \n Several mining tragedies globally have underscored the human toll of the coal supply chain. New EPA initiatives targeting air toxins, coal ash, and effluent releases highlight the environmental impacts of coal and the cost of addressing them with control technologies. The use of fracking in natural gas exploration is coming under scrutiny, with evidence of groundwater contamination and greenhouse gas emissions. Concerns are increasing about the vast amounts of water used at coal-fired and nuclear power plants, particularly in regions of the country facing water shortages. Events at the Fukushima nuclear plant have renewed doubts about the ability to operate large numbers of nuclear plants safely over the long term. Further, cost estimates for “next generation” nuclear units continue to climb, and lenders are unwilling to finance these plants without taxpayer guarantees.[18]\n Between 2010 and 2020, the cost of wind, solar, and natural gas dropped dramatically.[19] In 2018, EIA expected that, after rising by 2.7% in 2018, U.S. energy-related carbon dioxide (CO2) emissions would decrease by 2.5% in 2019 and by 1.0% in 2020[20] due to a shift away from coal and toward renewables and natural gas.\n Renewable energy has the potential to reduce CO2 emissions in three key energy use sectors: transport, heating and cooling (including building heating and air conditioning, industrial heat usage, etc.), and electricity. The year 2018 had been a peak year for the use of air conditioning, which was expected to decline.[20]\n Renewable energy accounted for 14.94% of the domestically produced electricity in 2016 in the United States.[26] This proportion has grown from just 7.7% in 2001, although the trend is sometimes obscured by large yearly variations in hydroelectric power generation. Most of the growth since 2001 can be seen in the expansion of wind generated power, and more recently, in the growth in solar generated power. Renewable energy in California is prominent, with around 29% of electricity coming from RPS-eligible renewable sources (including hydropower).[27]\n The United States has some of the best renewable energy resources in the world, with the potential to meet a rising and significant share of the nation's energy demand. \nA quarter of the country's land area has winds strong enough to generate electricity at the same price as natural gas and coal.[28]\n Many of the new technologies that harness renewables—including wind, solar, geothermal, and biofuels—are, or soon will be, economically competitive with the fossil fuels that meet 85% of United States energy needs. Dynamic growth rates are driving down costs and spurring rapid advances in technologies.[28] Wind power and solar power are becoming increasingly important relative to the older and more established hydroelectric power source. By 2016 wind power covered 37.23% of total renewable electricity production against 43.62% for hydroelectric power. The remaining share of power was generated by biomass at 10.27%, solar power at 6.03% and geothermal with 2.86% of total renewable generation.\n In 2015, Georgetown, Texas became one of the first American cities to be powered entirely by renewable energy, choosing to do so for financial stability reasons.[29]\n The United States consumed about 4,000 TWh of electricity in 2012, and about 30,000 TWh (98 quadrillion BTU) of primary energy. Efficiency improvements are expected to reduce usage to 15,000 TWh by 2050.\n Using data from Electric Power Annual 2018[30] capacity projections, the expected changes in generating capabilities for renewable fuel sources  would result in an increase of 55.873 GW  of capacity coming on-line by the beginning of 2024. This would make a total of 277.77 gigawatts of renewable available by 2024 up 23.1% from 2018.  Using this generating capability and the capacity factors from 2018 data will result in a total of 798.19 terawatt-hours (TWh) of renewable electric energy in 2023. This would be up 61.84  TWh (+8.3%) from 2018.\n Hydroelectric power was the largest producer of renewable power in the United States until 2019 when it was overtaken by wind power.[31] \nIt produced 254.79 TWh which was 5.94 % of the nation's total electricity in 2022 and provided 26.48% of the total renewable power in the country.[2] \nThe United States is the third largest producer of hydroelectricity in the world after China and Brazil. \nThe Grand Coulee Dam is the 9th largest hydroelectric power station in the world and another six U.S. hydroelectric plants are among the 50 largest in the world. \nThe amount of hydroelectric power generated is strongly affected by changes in precipitation and surface runoff.\nHydroelectricity projects such as Hoover Dam, Grand Coulee Dam, and the Tennessee Valley Authority have become iconic large construction projects.\n Wind power capacity in the United States tripled from 2008 to 2016, at which time it supplied over 5% of the country's total electricity generation.  Wind power overtook hydroelectric as the largest source of renewable electricity generation in 2019, and accounted for 10.25% of the country's total electricity generation by in 2022.[34]\nWind and solar accounted for two-thirds of new energy installations in the United States in 2015.[35]\nUnited States wind power installed capacity exceeds 141 GW as of 2023.[2] \nThis capacity is exceeded only by China.\n The 1550MW Alta Wind Energy Center is the largest wind farm in the United States and the second largest in the world behind the Gansu Wind Farm.[36]\n There were 90,000 wind operations jobs in the United States in 2015. \nThe wind industry in the United States generates tens of thousands of jobs and billions of dollars of economic activity.[37] \nWind projects boost local tax bases, and revitalize the economy of rural communities by providing a steady income stream to farmers with wind turbines on their land.[33]\nGE Energy is the largest domestic wind turbine manufacturer.[33]\n In 2013, wind power received $5.936 billion in federal funding, which is 37% of all federal funding for electricity generation.[38]\n The United States has the potential of installing 10 terawatt (TW) of onshore wind power and 4 TW of offshore wind.[39] \nThe U.S. Department of Energy's report 20% Wind Energy by 2030 envisioned that wind power could supply 20% of all the country's electricity, which included a contribution of 4% from offshore wind power.[37] \nAdditional transmission lines will need to be added, to bring power from windy states to the rest of the country.[40] \nIn August 2011, a coalition of 24 governors asked the Obama administration to provide a more favorable business climate for the development of wind power.[41]\n Wind power has particularly surged, with Colorado producing 16,000 GWh in 2023, a testament to the state's investment in this clean energy source.[42]\n The United States is one of the world's largest producers of solar power.\nThe country pioneered solar farms and many key developments in concentrated solar and photovoltaics came out of national research.\n In 2022, utility scale solar contributed 145.6 TWh to the grid, with 142.6 TWh from photovoltaics and 3.0 TWh from thermal systems.[2] \nIn 2020, 2021, and 2022, EIA estimated that distributed solar generated 41.522 TWh, 49.164 TWh and 58.512 TWh respectively.[2] \nWhile utility-grade systems have well documented generation, distributed systems contributions to user electric power needs are not measured or controlled. \nTherefore, quantitative evaluation of distributed solar to the country's electric power sector has been lacking. \nRecently, the Energy Information Administration has begun estimating that contribution.[48][2] \nBefore 2008, most solar-generated electric energy was from thermal systems, however by 2011 photovoltaics had overtaken thermal.\n At the end of 2022, the United States had 70.6 gigawatts (GW) of installed utility-scale photovoltaic capacity.[2] The United States has some of the largest solar farms in the world. Mount Signal Solar had installed over 600 MW by 2018 and will have 800 MW of capacity upon completion. Solar Star is a 579 megawatt (MWAC) farm near Rosamond, California. Completed in June 2015, it uses 1.7 million solar panels, spread over 13 square kilometres (5.0 sq mi).[49][50][51] The Desert Sunlight Solar Farm is a 550 MW solar power plant in Riverside County, California, that uses thin-film solar photovoltaic modules made by First Solar.[52] The Topaz Solar Farm is a 550 MW photovoltaic power plant, in San Luis Obispo County, California.[53] The Blythe Solar Power Project is a 485 MW photovoltaic station planned for Riverside County, California.\n Many schools and businesses have building-integrated photovoltaic solar panels on their roof. Most of these are grid connected and use net metering laws to allow use of electricity in the evening that was generated during the daytime. New Jersey leads the nation with the least restrictive net metering law, while California leads in total number of homes which have solar panels installed. Many were installed because of the million solar roof initiative.[54] California decided that it is not moving forward fast enough on photovoltaic generation and in 2008 enacted a feed-in tariff. Washington state has a feed-in tariff of 15 ¢/kWh which increases to 54 ¢/kWh if components are manufactured in the state.[55] By 2015, California, Hawaii, Arizona and some other states were lowering payments to distributed solar owners and instituting new fees for grid usage. Tesla and a handful of other companies were promoting household grid-tied batteries while some electric companies were investing in utility-scale grid energy storage including very large batteries.\n Beginning with the 2014 data year,  Energy Information Administration has estimated distributed solar photovoltaic generation and distributed solar photovoltaic capacity.[48] \nThese non-utility scale estimates that the United States, generated the following additional electric energy from such distributed solar PV systems.[2]\n At the end of 2016 there were 1.76 GW total installed capacity of solar thermal power across the United States.[2]\nSolar thermal power is generally utility-scale.\nPrior to 2012, in six southwestern states (Arizona, California, Colorado, Nevada, New Mexico, and Utah) the US Bureau of Land Management owned nearly 98 million acres (400,000 km2) (an area larger than the state of Montana) that was open to proposals for solar power installations. \nTo streamline consideration of applications, the BLM produced a Programmatic Environmental Impact Statement (PEIS). \nBy the subsequent Record of Decision in October 2012, the BLM withdrew 78% of its land from possible solar development, leaving 19 million acres (77,000 km2) still open to applications for solar installations, an area nearly as large as South Carolina. Of the area left open to solar proposals, the BLM has identified 285 thousand acres in 17 highly favorable areas it calls Solar Energy Zones.[56][57][58]\n Solar thermal power plants designed for solar-only generation are well matched to summer noon peak loads in prosperous areas with significant cooling demands, such as the south-western United States. \nUsing thermal energy storage systems, solar thermal operating periods can even be extended to meet base-load needs.[59]\n A 2013 study by the US National Renewable Energy Laboratory concluded that utility-scale solar power plants directly disturb an average of 2.7 to 2.9 acres per gigawatt-hour/year, and use from 3.5 to 3.8 acres per gW-hr/year for the entire sites. \nAccording to a 2009 study, this intensity of land use is less than that of the country's average power plant using surface-mined coal.[60] Some of the land in the eastern portion of the Mojave Desert is to be preserved, but the solar industry is more interested in areas of the western desert, \"where the sun burns hotter and there is easier access to transmission lines\".[61]\n Some of the largest solar thermal power plants in the United States are in the south-west of the country, especially in the Mojave Desert.\nSolar Energy Generating Systems (SEGS) is the name given to nine solar power plants in the Mojave Desert commissioned between 1984 and 1991.[8]\nThe installation uses parabolic trough solar thermal technology along with natural gas to generate electricity. \nThe facility has a total of 400,000 mirrors and covers 1,000 acres (4 km2).\nThe plants have a total generating capacity of 354 MW.[8]\n Nevada Solar One generates 64MW of power and in Boulder City, Nevada, and was built by the U.S. Department of Energy (DOE), National Renewable Energy Laboratory (NREL), and Solargenix Energy. Nevada Solar One started producing electricity in June 2007.\nNevada Solar One uses parabolic troughs as thermal solar concentrators, heating tubes of liquid which act as solar receivers. These solar receivers are specially coated tubes made of glass and steel.  About 19,300 of these 4 metre long tubes are used in the newly built power plant. Nevada Solar One also uses a technology that collects extra heat by putting it into phase-changing molten salts.  This energy can then be drawn on at night.[62]\n The Ivanpah Solar Power Facility is a 392 megawatt (MW) solar power facility which is located in south-eastern California.[63] The facility formally opened on February 13, 2014.[64]\nThe Solana Generating Station is a 280 MW solar power plant which is near Gila Bend, Arizona, about 70 miles (110 km) southwest of Phoenix. The 250MW Mojave Solar Project is located near Barstow, California. The Crescent Dunes Solar Energy Project is a 110 megawatt (MW) solar thermal power project near Tonopah, about 190 miles (310 km) northwest of Las Vegas.[65]\n The United States is the world leader in online capacity and the generation of electricity from geothermal energy.[66] \nAccording to 2022 state energy data, geothermal energy provided approximately 16 terawatt-hours (TWh) of electricity, or 0.37% of the total electricity consumed in the country. \nAs of May 2007, geothermal electric power was generated in five states: Alaska, California, Hawaii, Nevada, and Utah.\nAccording to the Geothermal Energy Association's recent report, there were 75 new geothermal power projects underway in 12 states as of May 2007.\nThis is an increase of 14 projects in an additional three states compared to a survey completed in November 2006.[66]\n The most significant catalyst behind new industry activity is the Energy Policy Act of 2005. \nThis Act made new geothermal plants eligible for the full federal production tax credit, previously available only to wind power projects. \nIt also authorized and directed increased funding for research by the Department of Energy, and gave the Bureau of Land Management new legal guidance and secure funding to address its backlog of geothermal leases and permits.[66]\n In 2022, biomass generated 51.847 terawatt-hours (TWh) of electricity, or 1.21% of the country's total electricity production. \nBiomass was the largest source of renewable primary energy in the US, and the fourth-largest renewable source of electrical power in the US, after wind, hydropower, and solar.[2]\n Biomass electric generation data combines two basic categories:\n Wave power in the United States is under development in several locations off the east and west coasts as well as Hawaii. It has moved beyond the research phase and is producing reliable energy. Its use to-date has been for situations where other forms of energy production are not economically viable and as such, the power output is currently modest. But major installations are planned to come on-line within the next few years.[citation needed]\n The U.S. Department of Energy stated (in 2006) that more than 1.5 million homes and businesses were currently using solar water heating in the United States, representing a capacity of over 1,000 megawatts (MW) of thermal energy generation. It predicted that another 400 MW was likely to be installed over the next 3–5 years.\n Assuming that 40 percent of existing homes in the United States have adequate access to sunlight, 29 million solar water heaters could be installed.[68]\n Solar water heaters can operate in any climate. Performance varies depending on how much solar energy is available at the site, as well as how cold the water coming into the system is. The colder the water, the more efficiently the system operates.[68]\n Solar water heaters reduce the need for conventional water heating by about two-thirds and pay for their installation within 4 to 8 years with electricity or natural gas savings. Compared to those with electric water heaters, Florida homeowners with solar water heaters save 50 to 85 percent on their water heating bills, according to the Florida Solar Energy Center.[68]\n Many cars sold in the U.S. since 2001 are able to run on blends of up to 15% ethanol.[69]\nOlder cars in the United States can run on blends of up to 10% ethanol. Motor vehicle manufacturers already produce vehicles designed to run on much higher ethanol blends. Ford, DaimlerChrysler, and GM are among the automobile companies that sell “flexible-fuel” cars, trucks, and minivans that can use gasoline and ethanol blends ranging from pure gasoline up to 85% ethanol (E85). By mid-2006, there were approximately 6 million E85-compatible vehicles on the road.[70]\n Ninety-five percent of gasoline sold in the U.S.(2016) is blended with 10% ethanol.[71] There are challenges in moving to higher blends, however. Flex-fuel vehicles are assisting in this transition because they allow drivers to choose different fuels based on price and availability. The Energy Independence and Security Act of 2007, which calls for 15.2 billion US gallons (58,000,000 m3) of biofuels to be used annually by 2012, will also help to expand the market.[70] The USDA in 2015 began offering grants to help gasoline retailers install blender pumps for dispensing mid-level ethanol blends.[72]\n The expanding ethanol and biodiesel industries are providing jobs in plant construction, operations, and maintenance, mostly in rural communities. According to the Renewable Fuels Association, the ethanol industry created almost 154,000 jobs in 2005 alone, boosting household income by $5.7 billion. It also contributed about $3.5 billion in tax revenues at the local, state, and federal levels.[70] On the other hand, in 2010, the biofuel industry received $6.64 billion in federal government support.[73]\n There are numerous organizations within the academic, federal, and commercial sectors conducting large-scale advanced research in the field of renewable energy. This research spans several areas of focus across the renewable energy spectrum. Most of the research is targeted at improving efficiency and increasing overall energy yields.[74] \nMultiple federally supported research organizations have focused on renewable energy in recent years. Two of the most prominent of these labs are Sandia National Laboratories (SNL) and the National Renewable Energy Laboratory (NREL), both of which are funded by the United States Department of Energy and supported by various corporate partners.[75] Sandia has a total budget of $2.4 billion[76] while NREL has a budget of $375 million.[77]\n Both the SNL and the NREL, have heavily funded solar research programs. BP was also heavily invested in solar research programs until 2008 when the company began scaling back its solar operations.[78] The company finally shut down its forty-year-old solar business after executives decided solar power production is not economically competitive.[78]  The NREL solar program has a budget of around $75 million[79] and develops research projects in the areas of photovoltaic (PV) technology, solar thermal energy, and solar radiation.[80]  The budget for Sandia's solar division is unknown, however it accounts for a significant percentage of the laboratory's $2.4 billion budget.[81] Several academic programs have focused on solar research in recent years. The Solar Energy Research Center (SERC) at University of North Carolina (UNC) has the sole purpose of developing cost effective solar technology.  In 2008, researchers at Massachusetts Institute of Technology (MIT) developed a method to store solar energy by using it to produce hydrogen fuel from water.[82]  Such research is targeted at addressing the obstacle that solar development faces of storing energy for use during nighttime hours when the sun is not shining. \nIn February 2012, North Carolina-based Semprius Inc., a solar development company backed by German corporation Siemens, announced that they had developed the world's most efficient solar panel. The company claims that the prototype converts 33.9% of the sunlight that hits it to electricity, more than double the previous high-end conversion rate.[83]\n Wind energy research dates back several decades to the 1970s when NASA developed an analytical model to predict wind turbine power generation during high winds.[84] Today, both the SNL and NREL have programs dedicated to wind research. Sandia's laboratory focuses on the advancement of materials, aerodynamics, and sensors.[85]  The NREL wind projects are centered on improving wind plant power production, reducing their capital costs, and making wind energy more cost effective overall.[86]\nThe Field Laboratory for Optimized Wind Energy (FLOWE) at Caltech was established to research renewable approaches to wind energy farming technology practices that have the potential to reduce the cost, size, and environmental impact of wind energy production.[87]\n As the primary source of biofuels in North America, many organizations are conducting research in the area of ethanol production. On the Federal level, the USDA conducts a large amount of research regarding ethanol production in the United States. Much of this research is targeted toward the effect of ethanol production on domestic food markets.[88]\nThe National Renewable Energy Laboratory has conducted various ethanol research projects, mainly in the area of cellulosic ethanol.[89] Cellulosic ethanol has many benefits over traditional corn-based ethanol. It does not take away or directly conflict with the food supply because it is produced from wood, grasses, or non-edible parts of plants.[90] Moreover, some studies have shown cellulosic ethanol to be more cost effective and economically sustainable than corn-based ethanol.[91] Sandia National Laboratories conducts in-house cellulosic ethanol research[92]  and is also a member of the Joint BioEnergy Institute (JBEI), a research institute founded by the United States Department of Energy with the goal of developing cellulosic biofuels.[93]\n Over $1 billion of federal money has been spent on the research and development of hydrogen fuel in the United States.[94] Both the NREL[95] and SNL[96] have departments dedicated to hydrogen research.\n White hydrogen could be found or produced in the Mid-continental Rift System at scale for a renewable hydrogen economy.  Water could be pumped down to hot iron-rich rock to produce hydrogen and the hydrogen could be extracted.[97][98]\n Accurate estimates regarding job creation as a result of an increasing reliance on renewable energy in the United States are challenging to predict due to unforeseen technological developments, uncertainty surrounding the United States’ future import/export levels of renewable energy technology, and ambiguity regarding indirect and induced employment effects. That being said, however, it is very likely that the United States would see a net increase in employment in the energy sector as a result of a renewable energy transition.[99][100][101] A study performed by Wei, Patadia, and Kammen about renewable energy efficiency in the United States found that the renewable energy sector generates significantly more jobs than the fossil fuel sector based on the per energy unit delivered.[101][102][103] The renewable energies found to have the highest employment per energy unit generated ratios are solar and wind; this is likely due to their installation components.[101] Although net employment would vary per location within the U.S. (for example, West Virginia's net employment would be more adversely impacted than California's due to West Virginia's coal mining industry), in total, net employment in the energy sector within the U.S. is projected to considerably increase.[101] The increase in direct employment as well as increased renewable energy infrastructure would naturally lead to additional indirect and induced jobs as well.\n Research done on countries in the European Union has affirmed this positive net employment notion. Towards a green energy economy? Tracking the employment effects of low-carbon technologies in the European Union, a study done by Markandya et al. used a multi-regional input-output model in conjunction with the World Input-Output Database to analyze data from 1995 - 2009 in search of net employment impacts.[100] These years were specifically considered as the European Union's energy structure was shifting significantly towards gas and other renewable forms of energy during this time. Although the country specific affects varied, it was found that 530,000 jobs overall were netted from the transition during this timeframe.[100] Another study done on Germany by Lehr, Lutz, and Edler used the PANTA RHEI model to evaluate the German energy situation by taking positive and negative renewable energy impacts into account.[101] The model considered different assumptions for fossil fuel prices, domestic installations, international trade, and German exports to developing renewable energy world markets. Under almost all of the scenarios, positive net employment effects were exhibited.[101]\n According to a 2019 CBS News poll on 2,143 U.S. residents, 42% of American adults under 45 years old thought that the U.S. could realistically transition to 100% renewable energy by 2050 while 29% deemed it unrealistic and 29% were unsure. Those numbers for older Americans are 34%, 40%, and 25%, respectively. Differences in opinion might be due to education as younger Americans are more likely to have been taught about climate change in schools than their elders.[105]\n The Energy Policy Act of 2005 requires all public electric utilities to facilitate net metering.[106]  This allows homes and businesses performing distributed generation to pay only the net cost of electricity from the grid: electricity used minus electricity produced locally and sent back into the grid.  For intermittent renewable energy sources this effectively uses the grid as a battery to smooth over lulls and fill in production gaps.\n Some jurisdictions go one step further and have instituted feed-in tariff, which allows any power customer to actually make money by producing more renewable energy than is consumed locally.\n From 2006 to 2014, US households received more than $18 billion in federal income tax credits for weatherizing their homes, installing solar panels, buying hybrid and electric vehicles, and other \"clean energy\" investments. These tax expenditures went predominantly to higher-income Americans. The bottom three income quintiles received about 10% of all credits, while the top quintile received about 60%. The most extreme is the program aimed at electric vehicles, where the top income quintile received about 90% of all credits. Market mechanisms have less skewed distributional effects.[107]\n The American Recovery and Reinvestment Act of 2009 included more than $70 billion in direct spending and tax credits for clean energy and associated transportation programs. This policy-stimulus combination represents the largest federal commitment in United States history for renewable energy, advanced transportation, and energy conservation initiatives. These new initiatives were expected to encourage many more utilities to strengthen their clean energy programs.[108] While the Department of Energy has come under criticism for providing loan guarantees to Solyndra,[109] its SunShot initiative has funded successful companies such as EnergySage[110] and Zep Solar.[111]\n In his January 24, 2012, State of the Union address, President Barack Obama restated his commitment to renewable energy, stating that he “will not walk away from the promise of clean energy.” Obama called for a commitment by the Defense Department to purchase 1,000 MW of renewable energy. He also mentioned the long-standing Interior Department commitment to permit 10,000 MW of renewable energy projects on public land in 2012.[12]\n Some Environmental Protection Agency facilities in the United States use renewable energy for all or part of their supply at the following facilities.[112]\n Energy technologies receive government subsidies. \nIn 2016, federal government energy-specific subsidies and supports for renewables, fossil fuels, and nuclear energy were $6,682 million, $489 million and $365 million, respectively. \n[113]\nAll but a few U.S. states now have incentives in place to promote renewable energy, while more than a dozen have enacted new renewable energy laws in recent years.[when?][28] \nRenewable energy suffered a political setback in the United States in September 2011 with the bankruptcy of Solyndra, a company that had received a $535 million federal loan guarantee.[114][115]\n Net metering is a policy by many states in the United States designed to help the adoption of renewable energy. Net metering was pioneered in the United States as a way to allow solar and wind to provide electricity whenever available and allow use of that electricity whenever it was needed, beginning with utilities in Idaho in 1980, and in Arizona in 1981.[116] In 1983, Minnesota passed the first state net metering law.[117] As of March 2015, 44 states and Washington, D.C. have developed mandatory net metering rules for at least some utilities.[118] However, although the states' rules are clear, few utilities actually compensate at full retail rates.[119]\n In February 2011, the U.S. Department of Energy (DOE) launched its SunShot Initiative, a collaborative national effort to cut the total cost of photovoltaic solar energy systems by 75% by 2020.[122] Reaching this goal would make unsubsidized solar energy cost-competitive with other forms of electricity and get grid parity .[123] The SunShot initiative included a crowdsourced innovation program run in partnership with Topcoder, during which 17 different solar energy application solutions were developed in 60 days.[124] In 2011, the price was $4/W, and the SunShot goal of $1/W by 2020 was reached in 2017.[125]\n Wind Powering America (WPA) is another DOE initiative that seeks to increase the use of wind energy. WPA collaborates with state and regional stakeholders, including farmers, ranchers, Native Americans, rural electric cooperatives, consumer-owned utilities and schools.[citation needed]\n WPA has focused on states with strong potential for wind energy generation but with few operational projects. WPA provides information about the challenges, benefits, and impacts of wind technology implementation.\n The Solar America Initiative (SAI)[126] is a part of the Federal Advanced Energy Initiative to accelerate the development of advanced photovoltaic materials with the goal of making it cost-competitive with other forms of renewable electricity by 2015.\n The DOE Solar Energy Technology Program (SETP) intended to achieve the goals of the SAI through partnerships and strategic alliances by focusing primarily on four areas:\n As part of former Governor Arnold Schwarzenegger's Million Solar Roofs Program, California set a goal to create 3,000 megawatts of new, solar-produced electricity by 2017, with funding of $2.8 billion.[127]\n The California Solar Initiative offers cash incentives on solar PV systems of up to $2.50 a watt. These incentives, combined with federal tax incentives, can cover up to 50% of the total cost of a solar panel system.[127] Financial incentives to support renewable energy are available in some other US states.[128]\n The EPA named the top 20 partners in its Green Power Partnership that are generating their own renewable energy on-site. Combined, they generate more than 736 million kilowatt-hours of renewable energy on-site each year, enough to power more than 61,000 average U.S. homes.[129]\n A Renewable Portfolio Standard refers to legislation that creates a market in tradeable renewable or green electricity certificates. Electricity distributors or wholesaler purchasers of electricity are required to source a specified percentage of their electricity (portfolio) from renewable generation sources. Liable entities that fall short of their quota can purchase certificates from accredited suppliers who have generated renewable electricity and obtained and registered certificates to sell on that market.\n By February 2024, at least 15% of counties in the United States had imposed bans or other restrictions to prevent construction of wind and solar projects.[130]\n The American Council on Renewable Energy (ACORE), is a non-profit organization with headquarters in Washington, D.C. It was founded in 2001 as a unifying forum for bringing renewable energy into the mainstream of America's economy and lifestyle. In 2010 ACORE had over 700 member organizations.[131] In 2007, ACORE published Outlook On Renewable Energy In America, a two volume report about the future of renewable energy in the United States.[132]  It has been said that this report exposes a \"new reality for renewable energy in America.\"[133]\n The Environmental and Energy Study Institute (EESI) is a non-profit organization which promotes environmentally sustainable societies.  Founded in 1984 by a group of Congressional Members, EESI seeks to be a catalyst that moves society away from environmentally damaging fossil fuels and toward a clean energy future. EESI presents policy solutions that will result in decreased global warming and air pollution; improvements in public health, energy security and rural economic development opportunities; increased use of renewable energy sources and improved energy efficiency.\n An important part of the mission of the National Renewable Energy Laboratory (NREL) is the transfer of NREL-developed technologies to renewable energy markets. NREL's Technology Transfer Office supports laboratory scientists and engineers in the successful and practical application of their expertise and the technologies they develop. R&D staff and facilities are recognized and valued by industry, as demonstrated through many collaborative research projects and licensed technologies with public and private partners. NREL's innovative technologies have also been recognized with 39 R&D 100 Awards.\n The Rocky Mountain Institute (RMI) is an organization dedicated to research, publication, consulting, and lecturing in the general field of sustainability, with a special focus on profitable innovations for energy and resource efficiency. RMI is headquartered in Snowmass, Colorado, and also maintains offices in Boulder, Colorado. RMI is the publisher of the book Winning the Oil Endgame.\n Community renewable energy efforts incorporate calls for energy democracy to place the responsibility of the planning and implementation processes of a renewable energy project within a community.[134] Community based renewable energy projects are expected to have a wide range of positive social impacts on top of decreasing fossil fuel usage, such as “acceptance of renewable energy developments; awareness of renewable and sustainable energy technologies and issues; uptake of low carbon technologies; and sustainable/pro-environmental behavior”.[135] However, in a survey conducted within a community about community renewable energy projects, results showed that while there was widespread support for implementation, there were low levels of desire for personal involvement, meaning many people shied away from potentially serving as project leaders.[135] Often times, the degree of ownership is debated within the planning process.[136]\n Community renewable energy projects prioritize the participation of the end-user communities, challenging the traditional power structures of renewable energy projects. Community renewable energy projects, and the slew of positive social impacts often associated with them, are only successful with institutional support.[135] Scholarships highlights the prevalence of institutional support in the EU and the UK for community based renewable energy, and not surprisingly, there are many more successful projects in Europe than there are in the United States.[137] Existing literature shows a clear lack of institutional support for community-based renewable energy projects within the United States. However, market-based investments in fields such as community-based solar and wind projects are evident in the US. The private sector has especially increased interest in community solar energy projects within the past couple of years.[138] The differing approaches to community-based renewable energy projects globally may be attributed to the differences within the liberal welfare states of Europe compared to the United States.\n The United States has the potential of installing 11 terawatt (TW) of onshore wind power and 4 TW of offshore wind power, capable of generating over 47,000 TWh. \nThe potential for concentrated solar power in the southwest is estimated at 10 to 20 TW, capable of generating over 10,000 TWh.[139]\n A 2012 report by the National Renewable Energy Laboratory evaluates the potential energy resources for each state of the United States.[140][141]\n Note: Total use is inflated to create an oil equivalence."
    },
    "12": {
        "document_name": "Solar_energy.html",
        "content": "Solar energy is a type of energy that comes from the sun's heat. People have been using solar energy for thousands of years in different ways, such as heating, cooking, and drying. Nowadays, it is also used to create electricity in areas where other sources of power are not available, such as remote locations and even outer space.\n The cost of generating electricity from solar energy is decreasing, making it a more affordable option. Since the sun provides heat and light constantly, solar energy is considered a renewable energy source and an alternative to non-renewable resources like coal and oil.\n Solar energy is used in various ways today, including:\n After passing through the Earth's atmosphere, most of the Sun's energy is in the form of visible light and infrared light radiation. Plants convert the energy in sunlight into chemical energy (sugars and starches) through the process of photosynthesis. Humans regularly use this store of energy in various ways, as when they burn wood off fossil fuels, or when simply eating plants, fish and animals.\n Solar radiation reaches the Earth's upper atmosphere with the power of 1366 watts per square meter (W/m2). Since the Earth is round, the surface nearer its poles is angled away from the Sun and receives much less solar energy than the surface nearer the equator.\n At present, solar cell panels convert, at best, about 15% of the sunlight hitting them into electricity.[1] \nThe dark disks in the third diagram on the right are imaginary examples of the amount of land that, if covered with 8% efficient solar panels, would produce slightly more energy in the form of electricity than the world needed in 2003.\n[2]\n Many technologies have been developed to make use of solar radiation.  Some of these technologies make direct use of the solar energy (e.g. to provide light, heat, etc.), while others produce electricity.\n Solar power plants convert sunlight into electricity, either directly using photovoltaics (PV), or indirectly using concentrated solar power (CSP). Concentrated solar power systems use lenses or mirrors and tracking systems to focus a large area of sunlight into a small beam. Photovoltaics converts light into electric current using the photoelectric effect.[3]\n Solar cooking uses the Sun as the source of energy instead of standard cooking fuels such as charcoal, coal or gas.  Solar cookers are an inexpensive and environmentally sound alternative to traditional ovens. They are becoming widely used in areas of the developing world where deforestation is an issue, financial resources to purchase fuel are limited, and where open flames would pose a serious risk to people and the environment. Solar cookers are covered with a glass plate. They achieve a higher temperature by using mirrors to focus the rays of the sun.\n  The Sun may be used to heat water instead of electricity or gas. There are two basic types of active solar heating systems based on the type of fluid — either liquid or air — that is heated in the solar energy collectors. (The collector is the device in which a fluid is heated by the Sun.)\n Liquid-based systems heat water or an antifreeze solution in a \"hydronic\" collector, whereas air-based systems heat air in an \"air collector.\"[28]  Both air and liquid systems can supplement forced air systems.\n Solar cells can be used to generate electricity from sunlight. It is a device that converts light energy into electrical energy. Sometimes the term solar cell is reserved for devices intended specifically to capture energy from sunlight, while the term photovoltaic cell is used when the light source is unspecified.\n Solar cells have many applications. They have long been used in situations where electrical power from the grid is unavailable, such as in remote area power systems, Earth-orbiting satellites and space probes, consumer systems, e.g. handheld calculators or wrist watches, remote radiotelephones and water pumping applications. A large no. of solar cells are combined in an arrangement called solar cell panel that can deliver enough electricity for practical use. Electricity produced by solar panels can be stored in rechargeable solar batteries, which is then drawn upon when required.[29]"
    },
    "13": {
        "document_name": "Solar_power.html",
        "content": "Solar power, also known as solar electricity, is the conversion of energy from sunlight into electricity, either directly using photovoltaics (PV) or indirectly using concentrated solar power. Solar panels use the photovoltaic effect to convert light into an electric current.[2] Concentrated solar power systems use lenses or mirrors and solar tracking systems to focus a large area of sunlight to a hot spot, often to drive a steam turbine.\n Photovoltaics were initially solely used as a source of electricity for small and medium-sized applications, from the calculator powered by a single solar cell to remote homes powered by an off-grid rooftop PV system. Commercial concentrated solar power plants were first developed in the 1980s. Since then, as the cost of solar panels has fallen, grid-connected solar PV systems' capacity and production has doubled about every three years. Three-quarters of new generation capacity is solar,[3] with both millions of rooftop installations and gigawatt-scale photovoltaic power stations continuing to be built.\n In 2023, solar generated 5% of the world's electricity,[4] compared to 1% in 2015, when the Paris Agreement to limit climate change was signed.[5] Along with onshore wind, in most countries, the cheapest levelised cost of electricity for new installations is utility-scale solar.[6][7]\n Almost half the solar power installed in 2022 was rooftop.[8] Much more low-carbon power is needed for electrification and to limit climate change.[3] The International Energy Agency said in 2022 that more effort was needed for grid integration and the mitigation of policy, regulation and financing challenges.[9]\n Geography affects solar energy potential because different locations receive different amounts of solar radiation. In particular, with some variations, areas that are closer to the equator generally receive higher amounts of solar radiation. However, solar panels that can follow the position of the Sun can significantly increase the solar energy potential in areas that are farther from the equator.[10] Daytime cloud cover can reduce the light available for solar cells. Besides, land availability has a large effect on the available solar energy.\n Solar power plants use one of two technologies:\n A solar cell, or photovoltaic cell, is a device that converts light into electric current using the photovoltaic effect. The first solar cell was constructed by Charles Fritts in the 1880s.[12] The German industrialist Ernst Werner von Siemens was among those who recognized the importance of this discovery.[13] In 1931, the German engineer Bruno Lange developed a photo cell using silver selenide in place of copper oxide,[14] although the prototype selenium cells converted less than 1% of incident light into electricity. Following the work of Russell Ohl in the 1940s, researchers Gerald Pearson, Calvin Fuller and Daryl Chapin created the silicon solar cell in 1954.[15] These early solar cells cost US$286/watt and reached efficiencies of 4.5–6%.[16] In 1957, Mohamed M. Atalla developed the process of silicon surface passivation by thermal oxidation at Bell Labs.[17][18] The surface passivation process has since been critical to solar cell efficiency.[19]\n As of 2022[update] over 90% of the market is crystalline silicon.[20] The array of a photovoltaic system, or PV system, produces direct current (DC) power which fluctuates with the sunlight's intensity. For practical use this usually requires conversion to alternating current (AC), through the use of inverters.[11] Multiple solar cells are connected inside panels. Panels are wired together to form arrays, then tied to an inverter, which produces power at the desired voltage, and for AC, the desired frequency/phase.[11]\n Many residential PV systems are connected to the grid wherever available, especially in developed countries with large markets.[21] \nIn these grid-connected PV systems, use of energy storage is optional. \nIn certain applications such as satellites, lighthouses, or in developing countries, batteries or additional power generators are often added as back-ups. Such stand-alone power systems permit operations at night and at other times of limited sunlight.\n In \"vertical agrivoltaics\" system, solar cells are oriented vertically on farmland, to allow the land to both grow crops and generate renewable energy.[22] Other configurations include floating solar farms, placing solar canopies over parking lots, and installing solar panels on roofs.[22]\n A thin-film solar cell is a second generation solar cell that is made by depositing one or more thin layers, or thin film (TF) of photovoltaic material on a substrate, such as glass, plastic or metal. Thin-film solar cells are commercially used in several technologies, including cadmium telluride (CdTe), copper indium gallium diselenide (CIGS), and amorphous thin-film silicon (a-Si, TF-Si).[23]\n A perovskite solar cell (PSC) is a type of solar cell that includes a perovskite-structured compound, most commonly a hybrid organic–inorganic lead or tin halide-based material as the light-harvesting active layer.[24][25] Perovskite materials, such as methylammonium lead halides and all-inorganic cesium lead halide, are cheap to produce and simple to manufacture.\n Concentrated solar power (CSP), also called \"concentrated solar thermal\", uses lenses or mirrors and tracking systems to concentrate sunlight, then uses the resulting heat to generate electricity from conventional steam-driven turbines.[31]\n A wide range of concentrating technologies exists: among the best known are the parabolic trough, the compact linear Fresnel reflector, the dish Stirling and the solar power tower. Various techniques are used to track the sun and focus light. In all of these systems a working fluid is heated by the concentrated sunlight and is then used for power generation or energy storage.[32] Thermal storage efficiently allows overnight electricity generation,[33] thus complementing PV.[34] CSP generates a very small share of solar power and in 2022 the IEA said that CSP should be better paid for its storage.[35]\n As of 2021[update] the levelized cost of electricity from CSP is over twice that of PV.[36] However, their very high temperatures may prove useful to help decarbonize industries (perhaps via hydrogen) which need to be hotter than electricity can provide.[37]\n A hybrid system combines solar with energy storage and/or one or more other forms of generation. Hydro,[38][39] wind[40][41] and batteries[42] are commonly combined with solar. The combined generation may enable the system to vary power output with demand, or at least smooth the solar power fluctuation.[43][44] There is a lot of hydro worldwide, and adding solar panels on or around existing hydro reservoirs is particularly useful, because hydro is usually more flexible than wind and cheaper at scale than batteries,[45] and existing power lines can sometimes be used.[46][47]\n The early development of solar technologies starting in the 1860s was driven by an expectation that coal would soon become scarce, such as experiments by Augustin Mouchot.[51] Charles Fritts installed the world's first rooftop photovoltaic solar array, using 1%-efficient selenium cells, on a New York City roof in 1884.[52] However, development of solar technologies stagnated in the early 20th century in the face of the increasing availability, economy, and utility of coal and petroleum.[53] Bell Telephone Laboratories’ 1950s research used silicon wafers with a very thin coating of boron. The “Bell Solar Battery” was described as 6% efficient, with a square yard of the panels generating 50 watts.[54] The first satellite with solar panels was launched in 1957.[55]\n By the 1970s, solar panels were still too expensive for much other than satellites.[56] In 1974 it was estimated that only six private homes in all of North America were entirely heated or cooled by functional solar power systems.[57] However, the 1973 oil embargo and 1979 energy crisis caused a reorganization of energy policies around the world and brought renewed attention to developing solar technologies.[58][59]\n Deployment strategies focused on incentive programs such as the Federal Photovoltaic Utilization Program in the US and the Sunshine Program in Japan. Other efforts included the formation of research facilities in the United States (SERI, now NREL), Japan (NEDO), and Germany (Fraunhofer ISE).[60] Between 1970 and 1983 installations of photovoltaic systems grew rapidly. In the United States, President Jimmy Carter set a target of producing 20% of U.S. energy from solar by the year 2000, but his successor, Ronald Reagan, removed the funding for research into renewables.[56] Falling oil prices in the early 1980s moderated the growth of photovoltaics from 1984 to 1996.\n In the mid-1990s development of both, residential and commercial rooftop solar as well as utility-scale photovoltaic power stations began to accelerate again due to supply issues with oil and natural gas, global warming concerns, and the improving economic position of PV relative to other energy technologies.[56][61] In the early 2000s, the adoption of feed-in tariffs—a policy mechanism, that gives renewables priority on the grid and defines a fixed price for the generated electricity—led to a high level of investment security and to a soaring number of PV deployments in Europe.\n For several years, worldwide growth of solar PV was driven by European deployment, but it then shifted to Asia, especially China and Japan, and to a growing number of countries and regions all over the world. The largest manufacturers of solar equipment were based in China.[62][63] Although concentrated solar power capacity grew more than tenfold, it remained a tiny proportion of the total,[64]: 51  because the cost of utility-scale solar PV fell by 85% between 2010 and 2020, while CSP costs only fell 68% in the same timeframe.[65]\n Despite the rising cost of materials, such as polysilicon, during the 2021–2022 global energy crisis,[66] utility scale solar was still the cheapest energy source in many countries due to the rising costs of other energy sources, such as natural gas.[67] In 2022, global solar generation capacity exceeded 1 TW for the first time.[68] However, fossil-fuel subsidies have slowed the growth of solar generation capacity.[69]\n About half of installed capacity is utility scale.[70]\n Most new renewable capacity between 2022 and 2027 is forecast to be solar, surpassing coal as the largest source of installed power capacity.[71]: 26  Utility scale is forecast to become the largest source of electricity in all regions except sub-Saharan Africa by 2050.[70]\n According to a 2021 study, global electricity generation potential of rooftop solar panels is estimated at 27 PWh per year at costs ranging from $40 (Asia) to $240 per MWh (US, Europe). Its practical realization will however depend on the availability and cost of scalable electricity storage solutions.[72]\n A photovoltaic power station, also known as a solar park, solar farm, or solar power plant, is a large-scale grid-connected photovoltaic power system (PV system) designed for the supply of merchant power. They are different from most building-mounted and other decentralized solar power because they supply power at the utility level, rather than to a local user or users. Utility-scale solar is sometimes used to describe this type of project.\n This approach differs from concentrated solar power, the other major large-scale solar generation technology, which uses heat to drive a variety of conventional generator systems. Both approaches have their own advantages and disadvantages, but to date, for a variety of reasons, photovoltaic technology has seen much wider use. As of 2019[update], about 97% of utility-scale solar power capacity was PV.[73][74]\n In some countries, the nameplate capacity of photovoltaic power stations is rated in megawatt-peak (MWp), which refers to the solar array's theoretical maximum DC power output. In other countries, the manufacturer states the surface and the efficiency. However, Canada, Japan, Spain, and the United States often specify using the converted lower nominal power output in MWAC, a measure more directly comparable to other forms of power generation. Most solar parks are developed at a scale of at least 1 MWp. As of 2018, the world's largest operating photovoltaic power stations surpassed 1 gigawatt. At the end of 2019, about 9,000 solar farms were larger than 4 MWAC (utility scale), with a combined capacity of over 220 GWAC.[73]\n Commercial concentrating solar power (CSP) plants, also called \"solar thermal power stations\", were first developed in the 1980s. The 377  MW Ivanpah Solar Power Facility, located in California's Mojave Desert, is the world's largest solar thermal power plant project. Other large CSP plants include the Solnova Solar Power Station (150 MW), the Andasol solar power station (150 MW), and Extresol Solar Power Station (150 MW), all in Spain. The principal advantage of CSP is the ability to efficiently add thermal storage, allowing the dispatching of electricity over up to a 24-hour period. Since peak electricity demand typically occurs at about 5 pm, many CSP power plants use 3 to 5 hours of thermal storage.[76]\n The typical cost factors for solar power include the costs of the modules, the frame to hold them, wiring, inverters, labour cost, any land that might be required, the grid connection, maintenance and the solar insolation that location will receive.\n Photovoltaic systems use no fuel, and modules typically last 25 to 40 years.[77] Thus upfront capital and financing costs make up 80 to 90% of the cost of solar power.[71]: 165 \n Some countries are considering price caps,[78] whereas others prefer contracts for difference.[79]\n In many countries solar power is the cheapest source of electricity.[80] In Saudi Arabia, a power purchase agreement (PPA) was signed in April 2021 for a new solar power plant in Al-Faisaliah. The project has recorded the world's lowest cost for solar PV electricity production of USD 1.04 cents/ kWh.[81]\n Expenses of high-power band solar modules has greatly decreased over time. Beginning in 1982, the cost per kW was approximately 27,000 American dollars, and in 2006 the cost dropped to approximately 4,000 American dollars per kW. The PV system in 1992 cost approximately 16,000 American dollars per kW and it dropped to approximately 6,000 American dollars per kW in 2008.[82]\n In 2021 in the US, residential solar cost from 2 to 4 dollars/watt (but solar shingles cost much more)[83] and utility solar costs were around $1/watt.[84]\n The productivity of solar power in a region depends on solar irradiance, which varies through the day and year and is influenced by latitude and climate. PV system output power also depends on ambient temperature, wind speed, solar spectrum, the local soiling conditions, and other factors.\n Onshore wind power tends to be the cheapest source of electricity in Northern Eurasia, Canada, some parts of the United States, and Patagonia in Argentina: whereas in other parts of the world mostly solar power (or less often a combination of wind, solar and other low carbon energy) is thought to be best.[85]: 8  Modelling by Exeter University suggests that by 2030 solar will be cheapest in all countries except for some in north-east Europe.[86]\n The locations with highest annual solar irradiance lie in the arid tropics and subtropics. Deserts lying in low latitudes usually have few clouds and can receive sunshine for more than ten hours a day.[87][88] These hot deserts form the Global Sun Belt circling the world. This belt consists of extensive swathes of land in Northern Africa, Southern Africa, Southwest Asia, Middle East, and Australia, as well as the much smaller deserts of North and South America.[89]\n So solar is (or is predicted to become) the cheapest source of energy in all of Central America, Africa, the Middle East, India, South-east Asia, Australia, and several other places.[85]: 8 \n Different measurements of solar irradiance (direct normal irradiance, global horizontal irradiance) are mapped below:\n In cases of self-consumption of solar energy, the payback time is calculated based on how much electricity is not purchased from the grid.[90] However, in many cases, the patterns of generation and consumption do not coincide, and some or all of the energy is fed back into the grid. The electricity is sold, and at other times when energy is taken from the grid, electricity is bought. The relative costs and prices obtained affect the economics. In many markets, the price paid for sold PV electricity is significantly lower than the price of bought electricity, which incentivizes self-consumption.[91] Moreover, separate self-consumption incentives have been used in e.g., Germany and Italy.[91] Grid interaction regulation has also included limitations of grid feed-in in some regions in Germany with high amounts of installed PV capacity.[91][92] By increasing self-consumption, the grid feed-in can be limited without curtailment, which wastes electricity.[93]\n A good match between generation and consumption is key for high self-consumption. The match can be improved with batteries or controllable electricity consumption.[93] However, batteries are expensive, and profitability may require the provision of other services from them besides self-consumption increase,[94] for example avoiding power outages.[95] Hot water storage tanks with electric heating with heat pumps or resistance heaters can provide low-cost storage for self-consumption of solar power.[93] Shiftable loads, such as dishwashers, tumble dryers and washing machines, can provide controllable consumption with only a limited effect on the users, but their effect on self-consumption of solar power may be limited.[93]\n The original political purpose of incentive policies for PV was to facilitate an initial small-scale deployment to begin to grow the industry, even where the cost of PV was significantly above grid parity, to allow the industry to achieve the economies of scale necessary to reach grid parity. Since reaching grid parity some policies are implemented to promote national energy independence,[96] high tech job creation[97] and reduction of CO2 emissions.[96]\n Financial incentives for photovoltaics differ across countries, including Australia,[98] China,[99] Germany,[100] India,[101] Japan, and the United States and even across states within the US.\n In net metering the price of the electricity produced is the same as the price supplied to the consumer, and the consumer is billed on the difference between production and consumption. Net metering can usually be done with no changes to standard electricity meters, which accurately measure power in both directions and automatically report the difference, and because it allows homeowners and businesses to generate electricity at a different time from consumption, effectively using the grid as a giant storage battery. With net metering, deficits are billed each month while surpluses are rolled over to the following month. Best practices call for perpetual roll over of kWh credits.[102] Excess credits upon termination of service are either lost or paid for at a rate ranging from wholesale to retail rate or above, as can be excess annual credits.[103]\n A community solar project is a solar power installation that accepts capital from and provides output credit and tax benefits to multiple customers, including individuals, businesses, nonprofits, and other investors. Participants typically invest in or subscribe to a certain kW capacity or kWh generation of remote electrical production.[105]\n In some countries tariffs (import taxes) are imposed on imported solar panels.[106][107]\n The overwhelming majority of electricity produced worldwide is used immediately because traditional generators can adapt to demand and storage is usually more expensive. Both solar power and wind power are sources of variable renewable power, meaning that all available output must be used locally, carried on transmission lines to be used elsewhere, or stored (e.g., in a battery). Since solar energy is not available at night, storing it so as to have continuous electricity availability is potentially an important issue, particularly in off-grid applications and for future 100% renewable energy scenarios.[111]\n Solar is intermittent due to the day/night cycles and variable weather conditions. However solar power can be forecast somewhat by time of day, location, and seasons.  The challenge of integrating solar power in any given electric utility varies significantly. In places with hot summers and mild winters, solar is well matched to daytime cooling demands.[112]\n Concentrated solar power plants may use thermal storage to store solar energy, such as in high-temperature molten salts. These salts are an effective storage medium because they are low-cost, have a high specific heat capacity, and can deliver heat at temperatures compatible with conventional power systems. This method of energy storage is used, for example, by the Solar Two power station, allowing it to store 1.44 TJ in its 68 m3 storage tank, enough to provide full output for close to 39 hours, with an efficiency of about 99%.[113]\n In stand alone PV systems batteries are traditionally used to store excess electricity. With grid-connected photovoltaic power systems, excess electricity can be sent to the electrical grid. Net metering and feed-in tariff programs give these systems a credit for the electricity they produce. This credit offsets electricity provided from the grid when the system cannot meet demand, effectively trading with the grid instead of storing excess electricity.[114] \nWhen wind and solar are a small fraction of the grid power, other generation techniques can adjust their output appropriately, but as these forms of variable power grow, additional balance on the grid is needed. As prices are rapidly declining, PV systems increasingly use rechargeable batteries to store a surplus to be used later at night. Batteries used for grid-storage can stabilize the electrical grid by leveling out peak loads for a few hours. In the future, less expensive batteries could play an important role on the electrical grid, as they can charge during periods when generation exceeds demand and feed their stored energy into the grid when demand is higher than generation.\n Common battery technologies used in today's home PV systems include nickel-cadmium, lead-acid, nickel metal hydride, and lithium-ion.[115][116][better source needed]Lithium-ion batteries have the potential to replace lead-acid batteries in the near future, as they are being intensively developed and lower prices are expected due to economies of scale provided by large production facilities such as the Gigafactory 1. In addition, the Li-ion batteries of plug-in electric cars may serve as future storage devices in a vehicle-to-grid system. Since most vehicles are parked an average of 95% of the time, their batteries could be used to let electricity flow from the car to the power lines and back. Retired EV batteries can be repurposed.[117] Other rechargeable batteries used for distributed PV systems include, sodium–sulfur and vanadium redox batteries, two prominent types of a molten salt and a flow battery, respectively.[118][119][120]\n Solar power plants, while they can be curtailed, usually simply output as much power as possible. Therefore in an electricity system without sufficient grid energy storage, generation from other sources (coal, biomass, natural gas, nuclear, hydroelectricity) generally go up and down in reaction to the rise and fall of solar electricity and variations in demand (see load following power plant). \n Conventional hydroelectric dams work very well in conjunction with solar power; water can be held back or released from a reservoir as required. Where suitable geography is not available, pumped-storage hydroelectricity can use solar power to pump water to a high reservoir on sunny days, then the energy is recovered at night and in bad weather by releasing water via a hydroelectric plant to a low reservoir where the cycle can begin again.[122]\n While hydroelectric and natural gas plants can quickly respond to changes in load; coal, biomass and nuclear plants usually take considerable time to respond to load and can only be scheduled to follow the predictable variation. Depending on local circumstances, beyond about 20–40% of total generation, grid-connected intermittent sources like solar tend to require investment in some combination of grid interconnections, energy storage or demand side management. In countries with high solar generation, such as Australia, electricity prices may become negative in the middle of the day when solar generation is high, thus incentivizing new battery storage.[123][124]\n The combination of wind and solar PV has the advantage that the two sources complement each other because the peak operating times for each system occur at different times of the day and year.[125] The power generation of such solar hybrid power systems is therefore more constant and fluctuates less than each of the two component subsystems.[126] Solar power is seasonal, particularly in northern/southern climates, away from the equator, suggesting a need for long term seasonal storage in a medium such as hydrogen or pumped hydroelectric.[127]\n Solar power is cleaner than electricity from fossil fuels,[20] so can be good for the environment when it replaces that.[128] Solar power does not lead to any harmful emissions during operation, but the production of the panels leads to some amount of pollution. A 2021 study estimated the carbon footprint of manufacturing monocrystalline panels at 515 g CO2/kWp in the US and 740 g CO2/kWp in China,[129] but this is expected to fall as manufacturers use more clean electricity and recycled materials.[130] Solar power carries an upfront cost to the environment via production with a carbon payback time of several years as of 2022[update],[130] but offers clean energy for the remainder of their 30-year lifetime.[131]\n The life-cycle greenhouse-gas emissions of solar farms are less than 50 gram (g) per kilowatt-hour (kWh),[132][133][134] but with battery storage could be up to 150 g/kWh.[135] In contrast, a combined cycle gas-fired power plant without carbon capture and storage emits around 500 g/kWh, and a coal-fired power plant about 1000 g/kWh.[136] Similar to all energy sources where their total life cycle emissions are mostly from construction, the switch to low carbon power in the manufacturing and transportation of solar devices would further reduce carbon emissions.[134]\n Lifecycle surface power density of solar power varies a lot[137] but averages about 7 W/m2, compared to about 240 for nuclear power and 480 for gas.[138] However when the land required for gas extraction and processing is accounted for gas power is estimated to have not much higher power density than solar.[20] PV requires much larger amounts of land surface to produce the same nominal amount of energy as sources[which?] with higher surface power density and capacity factor. According to a 2021 study, obtaining 25 to 80% of electricity from solar farms in their own territory by 2050 would require the panels to cover land ranging from 0.5 to 2.8% of the European Union, 0.3 to 1.4% in India, and 1.2 to 5.2% in Japan and South Korea.[139] Occupation of such large areas for PV farms could drive residential opposition as well as lead to deforestation, removal of vegetation and conversion of farm land.[140] However some countries, such as South Korea and Japan, use land for agriculture under PV,[141][142] or floating solar,[143] together with other low-carbon power sources.[144][145] Worldwide land use has minimal ecological impact.[146] Land use can be reduced to the level of gas power by installing on buildings and other built up areas.[137]\n Harmful materials are used in the production of solar panels, but in generally in small amounts.[147]  As of 2022[update] the environmental impact of perovskite is hard to estimate, but there is some concern that lead may become a problem.[20] A 2021 International Energy Agency study projects the demand for copper will double by 2040. The study cautions that supply needs to increase rapidly to match demand from large-scale deployment of solar and required grid upgrades.[148][149] More tellurium and indium may also be needed and recycling may help.[20]\n As solar panels are sometimes replaced with more efficient panels, the second-hand panels are sometimes reused in developing countries, for example in Africa.[150] Several countries have specific regulations for the recycling of solar panels.[151][152][153] Although maintenance cost is already low compared to other energy sources,[154] some academics have called for solar power systems to be designed to be more repairable.[155][156]\n A very small proportion of solar power is concentrated solar power. Concentrated solar power may use much more water than gas-fired power. This can be a problem, as this type of solar power needs strong sunlight so is often built in deserts.[157]\n Solar production cannot be cut off by geopolitics once installed, unlike oil and gas, which contributes to energy security.[159]\n As of 2022[update] over 40% of global polysilicon manufacturing capacity is in Xinjiang in China,[160] which raises concerns about human rights violations (Xinjiang internment camps) as well as supply chain dependency.[161]"
    },
    "14": {
        "document_name": "Sun.html",
        "content": "The Sun, also known as Sol, is a star at the center of the solar system. It is a white powerfully made by nature star that gives off different types of energy such as infrared energy (heat), ultraviolet light, radio waves and light. It also gives off a stream of particles, which reaches Earth as \"solar wind\". The source of all this energy is nuclear fusion. Nuclear fusion is the reaction in the star which turns hydrogen into helium and makes huge amounts of energy. It is a nearly perfect ball of hot plasma.\n The Sun looks yellow to a person standing on the Earth, but it is actually white. It looks yellow from the ground because the Earth's atmosphere scatters sunlight, causing shorter blue and green wavelengths to disperse, making the Sun's remaining visible light appear more yellow.\n The Sun is a star like many others in our Milky Way galaxy. The Sun is a type of star called a G-type main-sequence star based on its spectral class.[15]\n The Sun has existed for a little over 4.5 billion years.\n The Sun is about a hundred times as wide as the Earth. It has a mass of 1.9891×1030 kg. This is 333,000 times the mass of the Earth. 1.3 million Earths can fit inside the Sun.[16] The Sun fuses about 600 million tons of hydrogen into helium every second.\n The Sun is the main source of energy for the Earth. This energy is made deep inside the Sun in a process called nuclear fusion. Four hydrogen atoms are fused together to make one helium atom. Some of the leftover matter turns into energy. This is the same way energy is released in a hydrogen bomb.\n It can take between 10,000 and 170,000 years for the energy in the core of the Sun to escape.\n The Sun is the most important source of energy for life on Earth. Without the Sun, there would be no vegetation on Earth: every plant needs light to live and grow. Everything on Earth would freeze over without the Sun. The Sun gives the Earth heat as well as light. Plants make oxygen by photosynthesis. All humans and animals breathe oxygen. The Earth's position in the Solar System is just right for the development of life on Earth. \n The Sun is a G-type main-sequence star. It has about 99.86% of the mass of the Solar System. The Sun has an absolute magnitude of +4.83. It is brighter than about 85% of the stars in the Milky Way galaxy.[17][18] The Sun is a Population I star,[19]  i.e it  a metal-rich fairly young star.\n The Sun is the brightest object in the Earth's sky. It has an apparent magnitude of −26.74.[20] It takes 8 minutes and 19 seconds for light to travel from the Sun's surface to Earth's surface.[21]\n Scientists think that the Sun started from a very large cloud of dust and small bits of ice about 4.567 billion years ago.[22]\n At the center of that huge cloud, gravity caused the material to build up into a ball. Once this got big enough, the huge pressure inside started a fusion reaction. The energy this released caused that ball to heat and shine. At its very center, hydrogen atoms collide together at great temperature and pressure and fuse to form atoms of helium. This process is called nuclear fusion. It was proposed by Hans Bethe just before World War II.\n The Sun and everything that orbits it is in the Milky Way galaxy. The Sun orbits around the centre of the Milky Way. It takes along everything in the Solar System. The Sun moves at 820,000 km an hour. At that speed, it still takes 230 million years for a full orbit.\n Since the Sun is all gas, surface features come and go. If the Sun is viewed through a special solar telescope, dark areas called sunspots can be seen. These areas are caused by the Sun's magnetic field. The sunspots only look dark because the rest of the Sun is very bright.\n Some space telescopes, including the ones that orbit the Sun have seen huge arches of the Sun's matter extend suddenly from the Sun. These are called solar prominences. Solar prominences come in many different shapes and sizes. Some of them are so large that the Earth could fit inside of them, and a few are shaped like hands. Solar flares also come and go.\n Sunspots, prominences and flares become rare, and then numerous, and then rare again, every 11 years.\n This is the surface of the Sun. The light that the Earth receives from the Sun is radiated from this layer. Below this layer, the Sun is opaque, or not transparent to light.\n The Sun is mainly composed of hydrogen and helium. All elements heavier than hydrogen and helium, account for less than 2% of the mass of the Sun.[23][24]  The Sun's chemical composition was got from the interstellar medium. The hydrogen and most of the helium in the Sun would have been produced by Big Bang nucleosynthesis in the first 20 minutes of the universe. The heavier elements were produced by stars that died before the Sun was formed. The heavier elements were released into the interstellar medium when stars exploded as supernovae.[23][24]\n Five layers make up the atmosphere of the Sun. The chromosphere, transition region, and corona are much hotter than the outer photosphere surface of the Sun.[25] It is believed that Alfvén waves may pass through to heat the corona.[26]\n The minimum temperature zone, the coolest layer of the Sun, is about 500 kilometres (310 miles) above the photosphere. It has a temperature of about 4,100 K (3,830 °C; 6,920 °F).[25] This part of the Sun is cool enough to allow simple molecules such as carbon monoxide and water to form. These molecules can be seen on the Sun with special instruments called spectroscopes.[27]\n The chromosphere is the first layer of the Sun which can be seen, especially during a solar eclipse when the moon is covering most of the Sun and blocking the brightest light.\n The solar transition region is the part of the Sun's atmosphere, between the chromosphere and outer part called the corona.[28]  It can be seen from space using telescopes that can sense ultraviolet light. The transition is between two very different layers. In the bottom part it touches the photosphere and gravity shapes the features. At the top, the transition layer touches the corona.\n The corona is the outer atmosphere of the Sun and is much bigger than the rest of the Sun. The corona continuously expands into space forming the solar wind, which fills all the Solar System.[29] The average temperature of the corona and solar wind is about 1,000,000–2,000,000 K (1,800,000–3,600,000 °F). In the hottest regions it is 8,000,000–20,000,000 K (14,400,000–36,000,000 °F).[30] We do not understand why the corona is so hot.[29][30] It can be seen during a solar eclipse or with an instrument called a coronagraph.\n The heliosphere is the thin outer atmosphere of the Sun, filled with the solar wind plasma. It extends out past the orbit of Pluto to the heliopause, where it forms a boundary where it collides with the interstellar medium.[31]\n A solar eclipse appears when the moon is between the Earth and Sun. The last total solar eclipse occurred on December 26, 2019, and was visible from Saudi Arabia, India, Sumatra and Borneo, with a partial eclipse visible in Australia and much of Asia. \n A lunar eclipse happens when the moon passes through the shadow of the Earth which can only occur during a full moon. The number of lunar eclipses in a single year can range from 0 to 3. Partial eclipses slightly outnumber total eclipses by 7 to 6.[32]\n Astrophysicists say our Sun is a G-type main-sequence star in the middle of its life. In about billion years, increased solar energy will boil away the Earth's atmosphere and oceans. In a few more billion years, they think the Sun will get bigger and become a red giant star. The Sun would be up to 250 times its current size, as big as 1.4 AU (210,000,000 kilometres; 130,000,000 miles) and swallow up the Earth.\n Earth's fate is still unknown. In the long term, the Earth's future depends on the Sun, and the Sun is going to be fairly stable for the next 5 billion years.[33][34]  Calculations suggest that the Earth might move to a wider orbit. This is because about 30% of the Sun's mass will blow away in the solar wind. However, in the very long term the Earth will probably be destroyed as the Sun increases in size. Stars like the Sun become red giants at a later stage.[35] The Sun will expand beyond the orbits of Mercury, Venus, and probably Earth. In any event, the ocean and air would have vanished before the Sun gets to that stage.\n After the Sun reaches a point where it can no longer get bigger, it will lose its layers and form a planetary nebula. Eventually, the Sun will shrink into a white dwarf. Then, over several hundred billion or even a trillion years, the Sun would fade into a black dwarf.\n Google's 3D model of the sun."
    },
    "15": {
        "document_name": "Wind.html",
        "content": "Wind is the flow of gases. On Earth, wind is mostly the movement of air. In outer space, solar wind is the movement of gases or particles from the sun through space. The strongest winds seen on a planet in our solar system are on Neptune and Saturn.\n Short bursts of fast winds are called gusts. Strong winds that go on for about one minute are called squalls. Winds that go on for a long time are called many different things, such as breeze, gale, hurricane, and typhoon.\n Wind can move land, especially in deserts. Cold wind can sometimes have a bad effect on livestock. Wind also affects animals' food stores, their hunting and the way they protect themselves.\n Sunlight drives the Earth's atmospheric circulation. The resulting winds blow over land and sea, producing weather. \n A high pressure area (that makes an anticyclone) near a low pressure system (that makes a cyclone), makes air move from the high pressure to the low pressure to try to even out the pressures. The Coriolis effect causes the winds to spiral around. A big difference in pressure can make high winds.  In some storms, such as hurricanes, typhoons, cyclones, or tornadoes, it can cause winds faster than 200 mph (320 kilometres per hour). This can damage houses and other buildings, and can kill people.\n Wind can also be caused by the rising of hot air, or the falling of cool air. When hot air rises, it creates a low pressure underneath it, and air moves in to equalize the pressure. When cold air drops (because it is denser or heavier than warm air), it creates a high pressure and flows out to even out the pressure with the low pressure around it.\n The wind is usually invisible, but rain, dust, or snow can show how it is blowing. A weathervane can also show you where the wind is coming from. The Beaufort scale is a way to tell how strong the wind is. It is used at sea when no land can be seen. \n The increase in wind causes an increase in the rate of evaporation.\n High winds can cause damage depending on how strong they are. Sometimes gusts of wind can make poorly made bridges move or be destroyed, like the Tacoma Narrows Bridge in 1940.[1] Electric power distribution can fail because of wind, even if its speed is as low as 23 knots (43 km/h). This happens when tree branches damage power lines.[2] No kind of tree can resist hurricane-force winds, but trees with roots that are not very deep can be blown over more easily.  Trees such as eucalyptus, sea hibiscus, and avocado are brittle (easy to break) and are damaged more easily.[3]\n The trade winds  are  the prevailing pattern of easterly surface winds found in the tropics, within the lower portion of the Earth's atmosphere. They occur in the lower section of the troposphere near the Earth's equator. The trade winds blow predominantly from the northeast in the Northern Hemisphere. They blow from the southeast in the Southern Hemisphere. They are stronger during the winter and when the Arctic oscillation is in its warm phase. Trade winds have been used by captains of sailing ships to cross the world's oceans for centuries. They enabled European empire expansion into the Americas. They also allowed trade routes to become established across the Atlantic and Pacific oceans.\n The doldrums are in the equatorial region. It is a wind belt where air is warm, with little pressure variations. Winds are light there. Another name for doldrums is Intertropical Convergence Zone (ITCZ)\n Wind in outer space, called solar wind, is very different from a wind on earth.  This wind is caused by the sun, or other stars, and it is made up of particles that came out of the star's atmosphere.  Like solar wind, the planetary wind is made up of light gases that have come out of planets' atmospheres."
    },
    "16": {
        "document_name": "Wind_power.html",
        "content": "Wind power is the use of wind energy to generate useful work. Historically, wind power was used by sails, windmills and windpumps, but today it is mostly used to generate electricity. This article deals only with wind power for electricity generation.\nToday, wind power is generated almost completely with wind turbines, generally grouped into wind farms and connected to the electrical grid.\n In 2022, wind supplied over 2000 TWh of electricity, which was over 7% of world electricity[1]: 58  and about 2% of world energy.[2][3] With about 100 GW added during 2021, mostly in China and the United States, global installed wind power capacity exceeded 800 GW.[4][3][5] To help meet the Paris Agreement goals to limit climate change, analysts say it should expand much faster - by over 1% of electricity generation per year.[6]\n Wind power is considered a sustainable, renewable energy source, and has a much smaller impact on the environment compared to burning fossil fuels. \nWind power is variable, so it needs energy storage or other dispatchable generation energy sources to attain a reliable supply of electricity. \nLand-based (onshore) wind farms have a greater visual impact on the landscape than most other power stations per energy produced.[7][8] Wind farms sited offshore have less visual impact and have higher capacity factors, although they are generally more expensive.[4] Offshore wind power currently has a share of about 10% of new installations.[9]\n Wind power is one of the lowest-cost electricity sources per unit of energy produced. \nIn many locations, new onshore wind farms are cheaper than new coal or gas plants.[10]\n Regions in the higher northern and southern latitudes have the highest potential for wind power.[11] In most regions, wind power generation is higher in nighttime, and in winter when solar power output is low. For this reason, combinations of wind and solar power are suitable in many countries.[12]\n Wind is air movement in the Earth's atmosphere. In a unit of time, say 1 second, the volume of air that had passed an area \n\n\n\nA\n\n\n{\\displaystyle A}\n\n is \n\n\n\nA\nv\n\n\n{\\displaystyle Av}\n\n. If the air density is \n\n\n\nρ\n\n\n{\\displaystyle \\rho }\n\n , the mass of this volume of air is \n\n\n\nM\n=\nρ\nA\nv\n\n\n{\\displaystyle M=\\rho Av}\n\n, and the power transfer, or energy transfer per second is \n\n\n\nP\n=\n\n\n\n1\n2\n\n\n\nM\n\nv\n\n2\n\n\n=\n\n\n\n1\n2\n\n\n\nρ\nA\n\nv\n\n3\n\n\n\n\n{\\displaystyle P={\\tfrac {1}{2}}Mv^{2}={\\tfrac {1}{2}}\\rho Av^{3}}\n\n. Wind power is thus proportional to the third power of the wind speed; the available power increases eightfold when the wind speed doubles. Change of wind speed by a factor of 2.1544 increases the wind power by one order of magnitude (multiply by 10).\n The global wind kinetic energy averaged approximately 1.50 MJ/m2 over the period from 1979 to 2010, 1.31 MJ/m2 in the Northern Hemisphere with 1.70 MJ/m2 in the Southern Hemisphere. The atmosphere acts as a thermal engine, absorbing heat at higher temperatures, releasing heat at lower temperatures. The process is responsible for the production of wind kinetic energy at a rate of 2.46 W/m2 thus sustaining the circulation of the atmosphere against friction.[15]\n Through wind resource assessment, it is possible to estimate wind power potential globally, by country or region, or for a specific site. The Global Wind Atlas provided by the Technical University of Denmark in partnership with the World Bank provides a global assessment of wind power potential.[13][16][17]\nUnlike 'static' wind resource atlases which average estimates of wind speed and power density across multiple years, tools such as Renewables.ninja provide time-varying simulations of wind speed and power output from different wind turbine models at an hourly resolution.[18] More detailed, site-specific assessments of wind resource potential can be obtained from specialist commercial providers, and many of the larger wind developers have in-house modeling capabilities.\n The total amount of economically extractable power available from the wind is considerably more than present human power use from all sources.[19] The strength of wind varies, and an average value for a given location does not alone indicate the amount of energy a wind turbine could produce there.\n To assess prospective wind power sites, a probability distribution function is often fit to the observed wind speed data.[20] Different locations will have different wind speed distributions. The Weibull model closely mirrors the actual distribution of hourly/ten-minute wind speeds at many locations. The Weibull factor is often close to 2 and therefore a Rayleigh distribution can be used as a less accurate, but simpler model.[21]\n A wind farm is a group of wind turbines in the same location. A large wind farm may consist of several hundred individual wind turbines distributed over an extended area. The land between the turbines may be used for agricultural or other purposes. A wind farm may also be located offshore. Almost all large wind turbines have the same design — a horizontal axis wind turbine having an upwind rotor with 3 blades, attached to a nacelle on top of a tall tubular tower.\n In a wind farm, individual turbines are interconnected with a medium voltage (often 34.5 kV) power collection system[26] and communications network. In general, a distance of 7D (7 times the rotor diameter of the wind turbine) is set between each turbine in a fully developed wind farm.[27] At a substation, this medium-voltage electric current is increased in voltage with a transformer for connection to the high voltage electric power transmission system.[28]\n Most modern turbines use variable speed generators combined with either a partial or full-scale power converter between the turbine generator and the collector system, which generally have more desirable properties for grid interconnection and have low voltage ride through-capabilities.[29] Modern turbines use either doubly fed electric machines with partial-scale converters or squirrel-cage induction generators or synchronous generators (both permanently and electrically excited) with full-scale converters.[30] Black start is possible[31] and is being further developed for places (such as Iowa) which generate most of their electricity from wind.[32]\n Transmission system operators will supply a wind farm developer with a grid code to specify the requirements for interconnection to the transmission grid. This will include the power factor, the constancy of frequency, and the dynamic behaviour of the wind farm turbines during a system fault.[33][34]\n Offshore wind power is wind farms in large bodies of water, usually the sea. These installations can use the more frequent and powerful winds that are available in these locations and have less visual impact on the landscape than land-based projects. However, the construction and maintenance costs are considerably higher.[36][37]\n As of November 2021, the Hornsea Wind Farm in the United Kingdom is the largest offshore wind farm in the world at 1,218 MW.[38]\n Near offshore wind farms may be connected by AC and far offshore by HVDC.[39]\n Wind power resources are not always located near to high population density. As transmission lines become longer, the losses associated with power transmission increase, as modes of losses at lower lengths are exacerbated and new modes of losses are no longer negligible as the length is increased; making it harder to transport large loads over large distances.[40]\n When the transmission capacity does not meet the generation capacity, wind farms are forced to produce below their full potential or stop running altogether, in a process known as curtailment. While this leads to potential renewable generation left untapped, it prevents possible grid overload or risk to reliable service.[41]\n One of the biggest current challenges to wind power grid integration in some countries is the necessity of developing new transmission lines to carry power from wind farms, usually in remote lowly populated areas due to availability of wind, to high load locations, usually on the coasts where population density is higher.[42] Any existing transmission lines in remote locations may not have been designed for the transport of large amounts of energy.[43] In particular geographic regions, peak wind speeds may not coincide with peak demand for electrical power, whether offshore or onshore. A possible future option may be to interconnect widely dispersed geographic areas with an HVDC super grid.[44]\n In 2020, wind supplied almost 1600 TWh of electricity, which was over 5% of worldwide electrical generation and about 2% of energy consumption.[2][3] With over 100 GW added during 2020, mostly in China, global installed wind power capacity reached more than 730 GW.[4][3] But to help meet the Paris Agreement's goals to limit climate change, analysts say it should expand much faster - by over 1% of electricity generation per year.[6] Expansion of wind power is being hindered by fossil fuel subsidies.[48][49][50]\n The actual amount of electric power that wind can generate is calculated by multiplying the nameplate capacity by the capacity factor, which varies according to equipment and location. Estimates of the capacity factors for wind installations are in the range of 35% to 44%.[51]\n Since wind speed is not constant, a wind farm's annual energy production is never as much as the sum of the generator nameplate ratings multiplied by the total hours in a year. The ratio of actual productivity in a year to this theoretical maximum is called the capacity factor. Online data is available for some locations, and the capacity factor can be calculated from the yearly output.[52][53]\n Wind energy penetration is the fraction of energy produced by wind compared with the total generation. Wind power's share of worldwide electricity usage in 2021 was almost 7%,[55] up from 3.5% in 2015.[56][57]\n There is no generally accepted maximum level of wind penetration. The limit for a particular grid will depend on the existing generating plants, pricing mechanisms, capacity for energy storage, demand management, and other factors. An interconnected electric power grid will already include reserve generating and transmission capacity to allow for equipment failures. This reserve capacity can also serve to compensate for the varying power generation produced by wind stations. Studies have indicated that 20% of the total annual electrical energy consumption may be incorporated with minimal difficulty.[58] These studies have been for locations with geographically dispersed wind farms, some degree of dispatchable energy or hydropower with storage capacity, demand management, and interconnected to a large grid area enabling the export of electric power when needed. Electrical utilities continue to study the effects of large-scale penetration of wind generation on system stability.[59]\n A wind energy penetration figure can be specified for different duration of time but is often quoted annually. To generate almost all electricity from wind annually requires substantial interconnection to other systems, for example some wind power in Scotland is sent to the rest of the British grid.[60] On a monthly, weekly, daily, or hourly basis—or less—wind might supply as much as or more than 100% of current use, with the rest stored, exported or curtailed. The seasonal industry might then take advantage of high wind and low usage times such as at night when wind output can exceed normal demand. Such industry might include the production of silicon, aluminum,[61] steel, or natural gas, and hydrogen, and using future long-term storage to facilitate 100% energy from variable renewable energy.[62][63][better source needed] Homes and businesses can also be programmed to vary electricity demand,[64][65] for example by remotely turning up water heater thermostats.[66]\n Wind power is variable, and during low wind periods, it may need to be replaced by other power sources. Transmission networks presently cope with outages of other generation plants and daily changes in electrical demand, but the variability of intermittent power sources such as wind power is more frequent than those of conventional power generation plants which, when scheduled to be operating, may be able to deliver their nameplate capacity around 95% of the time.\n Electric power generated from wind power can be highly variable at several different timescales: hourly, daily, or seasonally. Annual variation also exists but is not as significant.[citation needed] Because instantaneous electrical generation and consumption must remain in balance to maintain grid stability, this variability can present substantial challenges to incorporating large amounts of wind power into a grid system. Intermittency and the non-dispatchable nature of wind energy production can raise costs for regulation, incremental operating reserve, and (at high penetration levels) could require an increase in the already existing energy demand management, load shedding, storage solutions, or system interconnection with HVDC cables.\n Fluctuations in load and allowance for the failure of large fossil-fuel generating units require operating reserve capacity, which can be increased to compensate for the variability of wind generation.\n Utility-scale batteries are often used to balance hourly and shorter timescale variation,[67][68] but car batteries may gain ground from the mid-2020s.[69] Wind power advocates argue that periods of low wind can be dealt with by simply restarting existing power stations that have been held in readiness, or interlinking with HVDC.[70]\n The combination of diversifying variable renewables by type and location, forecasting their variation, and integrating them with dispatchable renewables, flexible fueled generators, and demand response can create a power system that has the potential to meet power supply needs reliably. Integrating ever-higher levels of renewables is being successfully demonstrated in the real world.[71]\n Solar power tends to be complementary to wind.[73][74] On daily to weekly timescales, high-pressure areas tend to bring clear skies and low surface winds, whereas low-pressure areas tend to be windier and cloudier. On seasonal timescales, solar energy peaks in summer, whereas in many areas wind energy is lower in summer and higher in winter.[A][75] Thus the seasonal variation of wind and solar power tend to cancel each other somewhat.[72] Wind hybrid power systems are becoming more popular.[76]\n For any particular generator, there is an 80% chance that wind output will change less than 10% in an hour and a 40% chance that it will change 10% or more in 5 hours.[77]\n In summer 2021, wind power in the United Kingdom fell due to the lowest winds in seventy years,[78] In the future, smoothing peaks by producing green hydrogen may help when wind has a larger share of generation.[79]\n While the output from a single turbine can vary greatly and rapidly as local wind speeds vary, as more turbines are connected over larger and larger areas the average power output becomes less variable and more predictable.[29][80] Weather forecasting permits the electric-power network to be readied for the predictable variations in production that occur.[81]\n It is thought that the most reliable low-carbon electricity systems will include a large share of wind power.[82]\n Typically, conventional hydroelectricity complements wind power very well. When the wind is blowing strongly, nearby hydroelectric stations can temporarily hold back their water. When the wind drops they can, provided they have the generation capacity, rapidly increase production to compensate. This gives a very even overall power supply and virtually no loss of energy and uses no more water.\n Alternatively, where a suitable head of water is not available, pumped-storage hydroelectricity or other forms of grid energy storage such as compressed air energy storage and thermal energy storage can store energy developed by high-wind periods and release it when needed. The type of storage needed depends on the wind penetration level – low penetration requires daily storage, and high penetration requires both short- and long-term storage – as long as a month or more.[citation needed] Stored energy increases the economic value of wind energy since it can be shifted to displace higher-cost generation during peak demand periods. The potential revenue from this arbitrage can offset the cost and losses of storage. Although pumped-storage power systems are only about 75% efficient and have high installation costs, their low running costs and ability to reduce the required electrical base-load can save both fuel and total electrical generation costs.[83][84]\n The energy needed to build a wind farm divided into the total output over its life, Energy Return on Energy Invested, of wind power varies, but averages about 20–25.[85][86] Thus, the energy payback time is typically around a year.\n Onshore wind is an inexpensive source of electric power, cheaper than coal plants and new gas plants.[10] According to BusinessGreen, wind turbines reached grid parity (the point at which the cost of wind power matches traditional sources) in some areas of Europe in the mid-2000s, and in the US around the same time. Falling prices continue to drive the Levelized cost down and it has been suggested that it has reached general grid parity in Europe in 2010, and will reach the same point in the US around 2016 due to an expected reduction in capital costs of about 12%.[88][needs update] In 2021, the CEO of Siemens Gamesa warned that increased demand for low-cost wind turbines combined with high input costs and high costs of steel result in increased pressure on the manufacturers and decreasing profit margins.[89]\n Northern Eurasia, Canada, some parts of the United States, and Patagonia in Argentina are the best areas for onshore wind: whereas in other parts of the world solar power, or a combination of wind and solar, tend to be cheaper.[90]: 8 \n Wind power is capital intensive but has no fuel costs.[91] The price of wind power is therefore much more stable than the volatile prices of fossil fuel sources.[92] However, the estimated average cost per unit of electric power must incorporate the cost of construction of the turbine and transmission facilities, borrowed funds, return to investors (including the cost of risk), estimated annual production, and other components, averaged over the projected useful life of the equipment, which may be more than 20 years. Energy cost estimates are highly dependent on these assumptions so published cost figures can differ substantially.\n The presence of wind energy, even when subsidized, can reduce costs for consumers (€5 billion/yr in Germany) by reducing the marginal price, by minimizing the use of expensive peaking power plants.[93]\n The cost has decreased as wind turbine technology has improved. There are now longer and lighter wind turbine blades, improvements in turbine performance, and increased power generation efficiency. Also, wind project capital expenditure costs and maintenance costs have continued to decline.[94]\n In 2021, a Lazard study of unsubsidized electricity said that wind power levelized cost of electricity continues to fall but more slowly than before. The study estimated new wind-generated electricity cost from $26 to $50/MWh, compared to new gas power from $45 to $74/MWh. The median cost of fully deprecated existing coal power was $42/MWh, nuclear $29/MWh and gas $24/MWh. The study estimated offshore wind at around $83/MWh. Compound annual growth rate was 4% per year from 2016 to 2021, compared to 10% per year from 2009 to 2021.[10]\n Turbine prices have fallen significantly in recent years due to tougher competitive conditions such as the increased use of energy auctions, and the elimination of subsidies in many markets.[95] As of 2021, subsidies are still often given to offshore wind. But they are generally no longer necessary for onshore wind in countries with even a very low carbon price such as China, provided there are no competing fossil fuel subsidies.[96]\n Secondary market forces provide incentives for businesses to use wind-generated power, even if there is a premium price for the electricity. For example, socially responsible manufacturers pay utility companies a premium that goes to subsidize and build new wind power infrastructure. Companies use wind-generated power, and in return, they can claim that they are undertaking strong \"green\" efforts.[97] Wind projects provide local taxes, or payments in place of taxes and strengthen the economy of rural communities by providing income to farmers with wind turbines on their land.[98][99]\n The wind energy sector can also produce jobs during the construction and operating phase.[100] Jobs include the manufacturing of wind turbines and the construction process, which includes transporting, installing, and then maintaining the turbines. An estimated 1.25 million people were employed in wind power in 2020.[101]\n Small-scale wind power is the name given to wind generation systems with the capacity to produce up to 50 kW of electrical power.[102] Isolated communities, that may otherwise rely on diesel generators, may use wind turbines as an alternative. Individuals may purchase these systems to reduce or eliminate their dependence on grid electric power for economic reasons, or to reduce their carbon footprint. Wind turbines have been used for household electric power generation in conjunction with battery storage over many decades in remote areas.[103]\n Examples of small-scale wind power projects in an urban setting can be found in New York City, where, since 2009, several building projects have capped their roofs with Gorlov-type helical wind turbines. Although the energy they generate is small compared to the buildings' overall consumption, they help to reinforce the building's 'green' credentials in ways that \"showing people your high-tech boiler\" cannot, with some of the projects also receiving the direct support of the New York State Energy Research and Development Authority.[104]\n Grid-connected domestic wind turbines may use grid energy storage, thus replacing purchased electric power with locally produced power when available. The surplus power produced by domestic microgenerators can, in some jurisdictions, be fed into the network and sold to the utility company, producing a retail credit for the microgenerators' owners to offset their energy costs.[105]\n Off-grid system users can either adapt to intermittent power or use batteries, photovoltaic, or diesel systems to supplement the wind turbine.[106] Equipment such as parking meters, traffic warning signs, street lighting, or wireless Internet gateways may be powered by a small wind turbine, possibly combined with a photovoltaic system, that charges a small battery replacing the need for a connection to the power grid.[107]\n Airborne wind turbines, such as kites, can be used in places at risk of hurricanes, as they can be taken down in advance.[108]\n The environmental impact of electricity generation from wind power is minor when compared to that of fossil fuel power.[110] Wind turbines have some of the lowest life-cycle greenhouse-gas emissions of energy sources: far less greenhouse gas is emitted than for the average unit of electricity, so wind power helps limit climate change.[111] Use of engineered wood may allow carbon negative wind power.[112] Wind power consumes no fuel, and emits no local air pollution, unlike fossil fuel power sources.\n Onshore wind farms can have a significant visual impact.[113] Due to a very low surface power density and spacing requirements, wind farms typically need to be spread over more land than other power stations.[7][114] Their network of turbines, access roads, transmission lines, and substations can result in \"energy sprawl\";[8] although land between the turbines and roads can still be used for agriculture.[115][116] Some wind farms are opposed for potentially spoiling protected scenic areas, archaeological landscapes and heritage sites.[117][118][119] A report by the Mountaineering Council of Scotland concluded that wind farms harmed tourism in areas known for natural landscapes and panoramic views.[120]\n Habitat loss and fragmentation are the greatest potential impacts on wildlife of onshore wind farms,[8] but the worldwide ecological impact is minimal.[110] Thousands of birds and bats, including rare species, have been killed by wind turbine blades,[121] though wind turbines are responsible for far fewer bird deaths than fossil-fueled power stations.[122] This can be mitigated with proper wildlife monitoring.[123]\n Many wind turbine blades are made of fiberglass, and have a lifetime of 20 years.[124] Blades are hollow: some blades are crushed to reduce their volume and then landfilled.[125] However, as they can take a lot of weight they can be made into long lasting small bridges for walkers or cyclists.[126] Blade end-of-life is complicated,[127] and blades manufactured in the 2020s are more likely to be designed to be completely recyclable.[128]\n Wind turbines also generate noise. At a distance of 300 metres (980 ft), this may be around 45 dB, which is slightly louder than a refrigerator. At 1.5 km (1 mi), they become inaudible.[129][130] There are anecdotal reports of negative health effects on people who live very close to wind turbines.[131] Peer-reviewed research has generally not supported these claims.[132][133][134]\n Although wind turbines with fixed bases are a mature technology and new installations are generally no longer subsidized,[135][136] floating wind turbines are a relatively new technology so some governments subsidize them, for example to use deeper waters.[137]\n Fossil fuel subsidies by some governments are slowing the growth of renewables.[138]\n Permitting of wind farms can take years and some governments are trying to speed up - the wind industry says this will help limit climate change and increase energy security[139] - sometimes groups such as fishers resist this[140] but governments say that rules protecting biodiversity will still be followed.[141]\n Surveys of public attitudes across Europe and in many other countries show strong public support for wind power.[143][144][145] Bakker et al. (2012) found in their study that residents who did not want turbines built near them suffered significantly more stress than those who \"benefited economically from wind turbines\".[146]\n Although wind power is a popular form of energy generation, onshore or near offshore wind farms are sometimes opposed for their impact on the landscape (especially scenic areas, heritage areas and archaeological landscapes), as well as noise, and impact on tourism.[147][148]\n In other cases, there is direct community ownership of wind farms. The hundreds of thousands of people who have become involved in Germany's small and medium-sized wind farms demonstrate such support there.[149]\n A 2010 Harris Poll found strong support for wind power in Germany, other European countries, and the United States.[143][144][150]\n Public support in the United States has decreased from 75% in 2020 to 62% in 2021, with the Democrat Party supporting the use of wind energy twice as much as the Republican Party.[151] President Biden has signed an executive order to begin building large scale wind farms.[152]\n In China, Shen et al. (2019) found that Chinese city-dwellers may be resistant to building wind turbines in urban areas, with a surprisingly high proportion of people citing an unfounded fear of radiation as driving their concerns.[153] Also, the study finds that like their counterparts in OECD countries, urban Chinese respondents are sensitive to direct costs and wildlife externalities. Distributing relevant information about turbines to the public may alleviate resistance.\n Many wind power companies work with local communities to reduce environmental and other concerns associated with particular wind farms.[156][157][158]\nIn other cases there is direct community ownership of wind farm projects. Appropriate government consultation, planning and approval procedures also help to minimize environmental risks.[143][159][160]\nSome may still object to wind farms[161] but many say their concerns should be weighed against the need to address the threats posed by air pollution,[162][111] climate change[163] and the opinions of the broader community.[164]\n In the US, wind power projects are reported to boost local tax bases, helping to pay for schools, roads, and hospitals, and to revitalize the economies of rural communities by providing steady income to farmers and other landowners.[98]\n In the UK, both the National Trust and the Campaign to Protect Rural England have expressed concerns about the effects on the rural landscape caused by inappropriately sited wind turbines and wind farms.[165][166]\n Some wind farms have become tourist attractions. The Whitelee Wind Farm Visitor Centre has an exhibition room, a learning hub, a café with a viewing deck and also a shop. It is run by the Glasgow Science Centre.[167]\n In Denmark, a loss-of-value scheme gives people the right to claim compensation for loss of value of their property if it is caused by proximity to a wind turbine. The loss must be at least 1% of the property's value.[168]\n Despite this general support for the concept of wind power in the public at large, local opposition often exists and has delayed or aborted a number of projects.[169][170][171]\nAs well as concerns about the landscape, there are concerns that some installations can produce excessive sound and vibration levels leading to a decrease in property values.[172] A study of 50,000 home sales near wind turbines found no statistical evidence that prices were affected.[173]\n While aesthetic issues are subjective and some find wind farms pleasant and optimistic, or symbols of energy independence and local prosperity, protest groups are often formed to attempt to block some wind power stations for various reasons.[161][174][175]\n Some opposition to wind farms is dismissed as NIMBYism,[176] but research carried out in 2009 found that there is little evidence to support the belief that residents only object to wind farms because of a \"Not in my Back Yard\" attitude.[177]\n Wind cannot be cut off unlike oil and gas so can contribute to energy security.[178]\n Wind turbines are devices that convert the wind's kinetic energy into electrical power. The result of over a millennium of windmill development and modern engineering, today's wind turbines are manufactured in a wide range of horizontal axis and vertical axis types. The smallest turbines are used for applications such as battery charging for auxiliary power. Slightly larger turbines can be used for making small contributions to a domestic power supply while selling unused power back to the utility supplier via the electrical grid. Arrays of large turbines, known as wind farms, have become an increasingly important source of renewable energy and are used in many countries as part of a strategy to reduce their reliance on fossil fuels.\n Wind turbine design is the process of defining the form and specifications of a wind turbine to extract energy from the wind.[179]\nA wind turbine installation consists of the necessary systems needed to capture the wind's energy, point the turbine into the wind, convert mechanical rotation into electrical power, and other systems to start, stop, and control the turbine.\n In 1919, the German physicist Albert Betz showed that for a hypothetical ideal wind-energy extraction machine, the fundamental laws of conservation of mass and energy allowed no more than 16/27 (59%) of the kinetic energy of the wind to be captured. This Betz limit can be approached in modern turbine designs, which may reach 70 to 80% of the theoretical Betz limit.[180][181]\n The aerodynamics of a wind turbine are not straightforward. The airflow at the blades is not the same as the airflow far away from the turbine. The very nature of how energy is extracted from the air also causes air to be deflected by the turbine. This affects the objects or other turbines downstream, which is known as \"wake effect\". Also, the aerodynamics of a wind turbine at the rotor surface exhibit phenomena that are rarely seen in other aerodynamic fields. The shape and dimensions of the blades of the wind turbine are determined by the aerodynamic performance required to efficiently extract energy from the wind, and by the strength required to resist the forces on the blade.[182]\n In addition to the aerodynamic design of the blades, the design of a complete wind power system must also address the design of the installation's rotor hub, nacelle, tower structure, generator, controls, and foundation.[183]\n Wind power has been used as long as humans have put sails into the wind. King Hammurabi's Codex (reign 1792 - 1750 BC) already mentioned windmills for generating mechanical energy.[184] Wind-powered machines used to grind grain and pump water, the windmill and wind pump, were developed in what is now Iran, Afghanistan, and Pakistan by the 9th century.[185][186] Wind power was widely available and not confined to the banks of fast-flowing streams, or later, requiring sources of fuel. Wind-powered pumps drained the polders of the Netherlands, and in arid regions such as the American mid-west or the Australian outback, wind pumps provided water for livestock and steam engines.\n The first windmill used for the production of electric power was built in Scotland in July 1887 by Prof James Blyth of Anderson's College, Glasgow (the precursor of Strathclyde University).[187] Blyth's 10 metres (33 ft) high cloth-sailed wind turbine was installed in the garden of his holiday cottage at Marykirk in Kincardineshire, and was used to charge accumulators developed by the Frenchman Camille Alphonse Faure, to power the lighting in the cottage,[187] thus making it the first house in the world to have its electric power supplied by wind power.[188] Blyth offered the surplus electric power to the people of Marykirk for lighting the main street, however, they turned down the offer as they thought electric power was \"the work of the devil.\"[187] Although he later built a wind turbine to supply emergency power to the local Lunatic Asylum, Infirmary, and Dispensary of Montrose, the invention never really caught on as the technology was not considered to be economically viable.[187]\n Across the Atlantic, in Cleveland, Ohio, a larger and heavily engineered machine was designed and constructed in the winter of 1887–1888 by Charles F. Brush.[189] This was built by his engineering company at his home and operated from 1886 until 1900.[190] The Brush wind turbine had a rotor 17 metres (56 ft) in diameter and was mounted on an 18 metres (59 ft) tower. Although large by today's standards, the machine was only rated at 12 kW. The connected dynamo was used either to charge a bank of batteries or to operate up to 100 incandescent light bulbs, three arc lamps, and various motors in Brush's laboratory.[191]\nWith the development of electric power, wind power found new applications in lighting buildings remote from centrally generated power. Throughout the 20th century parallel paths developed small wind stations suitable for farms or residences. \nFrom 1932 many isolated properties in Australia ran their lighting and electric fans from batteries, charged by a \"Freelite\" wind-driven generator, producing 100 watts of electrical power from as little wind speed as 10 miles per hour (16 km/h).[192]\n The 1973 oil crisis triggered the investigation in Denmark and the United States that led to larger utility-scale wind generators that could be connected to electric power grids for remote use of power. By 2008, the U.S. installed capacity had reached 25.4 gigawatts, and by 2012 the installed capacity was 60 gigawatts.[193] Today, wind-powered generators operate in every size range between tiny stations for battery charging at isolated residences, up to gigawatt-sized offshore wind farms that provide electric power to national electrical networks. The European Union is working to augment these prospects.[194]"
    }
}